{"episodes":[{"name":"Pilot","overview":"Billionaire playboy, Oliver Queen, has been considered dead for five years. Now, he has returned. But something, during those five years, has changed him into a mysterious green hooded archer.","id":64111,"episode_number":1,"season_number":1,"still_path":"/zaqAlAdjZGBuFMsHsLUYjDlgm9r.jpg","vote_average":5.8333335},{"name":"Honor Thy Father","overview":"Arrow moves further along his father\u0027s list while battling family issues with his mother, Moira, and especially with his sister. He also makes amends for past difficulties with Laurel.","id":64112,"episode_number":2,"season_number":1,"still_path":"/vd1muBD34LjjKoHUx0J0Dnx1NGt.jpg","vote_average":6.0},{"name":"Lone Gunmen","overview":"A mysterious sniper called Deadshot is taking out bidders at an auction for an industry company. The bidders include Oliver\u0027s stepfather, Walter Steele.","id":64113,"episode_number":3,"season_number":1,"still_path":"/4jO4E9vk7yEMDNyRYQITpN5Wgs4.jpg","vote_average":7.6666665},{"name":"An Innocent Man","overview":"Peter Declan has been charged with murdering his wife, and only Oliver believes he\u0027s innocent. Arrow asks Laurel to look into Declan\u0027s case. Meanwhile, Walter investigates a warehouse that Moira mysteriously bought with the company\u0027s money.","id":64116,"episode_number":4,"season_number":1,"still_path":"/gf5M5oC7jAuzisQh7uy9XJMzsdO.jpg","vote_average":7.0},{"name":"Damaged","overview":"Oliver is accused of being the hooded archer and is put under house arrest. Also, he thinks back to his time on the island, where he first met Edward Fyers and Deathstroke.","id":64114,"episode_number":5,"season_number":1,"still_path":"/dy6AyCilp9fbFkaB3iV0jU8o4sd.jpg","vote_average":7.0},{"name":"Legacies","overview":"Diggle convinces Oliver to go after bank robbers even though they\u0027re not on Robert Queen\u0027s list. However, Oliver soon discovers that they may be connected to his father after all. Meanwhile, Tommy asks Thea for dating advice and Moira feels the sting of Walter\u0027s departure and Oliver\u0027s cavalier attitude toward her.","id":64115,"episode_number":6,"season_number":1,"still_path":"/dWIHQtl23rZRkxbjSGetvyxYcnl.jpg","vote_average":6.0},{"name":"Muse of Fire","overview":"A new vigilante in Starling City is going after mobster Frank Bertinelli. However, when the vigilante almost hits Moira, Oliver vows to put an end to the newcomer\u0027s reign of terror. Meanwhile, Tommy gets a rude surprise from his father.","id":64117,"episode_number":7,"season_number":1,"still_path":"/lAlDrloYtONo85iSgd8Sf218EEn.jpg","vote_average":6.5},{"name":"Vendetta","overview":"Oliver Queen attempts to train Helena Bertinelli in the hopes that she will join him in his fight for justice. Meanwhile, Walter Steele delves deeper into his wife\u0027s secrets.","id":64118,"episode_number":8,"season_number":1,"still_path":"/pTIyBHzDFVo8rCWpHYVVMnz1L5Z.jpg","vote_average":6.0},{"name":"Year\u0027s End","overview":"A mysterious archer is on the loose in Starling City, framing Oliver for murders he didn\u0027t commit. As Oliver tries to track the copy cat down with Quentin\u0027s help, he tries to juggle his responsibilities to his family when he tries to arrange a Christmas party to bring the Queens together during the holiday.","id":64119,"episode_number":9,"season_number":1,"still_path":"/Jzh2g9fGcyKyqFHNS80QRk1oxY.jpg","vote_average":7.0},{"name":"Burned","overview":"Oliver’s confidence is shaken after being beaten by the Dark Archer and he takes a break from being Arrow. However, when Laurel calls Arrow for help investigating a firefighter’s suspicious death, he reluctantly agrees but his hesitance while fighting almost costs him his life. Meanwhile, Tommy throws a benefit for the firefighters and Thea tries to lift Moira out of her depressive state.","id":64120,"episode_number":10,"season_number":1,"still_path":"/xlNJXMRhuMgWdsfgAgfmBSG8CtW.jpg","vote_average":5.5},{"name":"Trust But Verify","overview":"An armored bank robbery puts Oliver on the trial of Ted Gaynor, a man on his father\u0027s list... and Diggle\u0027s former commanding officer. Meanwhile, Thea suspects that Malcolm and Moira are having an affair, and Malcolm tries to make amends with Tommy.","id":64121,"episode_number":11,"season_number":1,"still_path":"/6WsgWOZ91lV8oJodxwM3vl5KSxw.jpg","vote_average":6.0},{"name":"Vertigo","overview":"Starling City is overwhelmed by a flood of a new drug, Vertigo, and Thea is arrested after using it. Oliver sets out to seek down the drug\u0027s creator, The Count, only to be dosed with it himself.","id":64124,"episode_number":12,"season_number":1,"still_path":"/kDjvaQZAX8H58L6iJxhItHrvwhm.jpg","vote_average":6.5},{"name":"Betrayal","overview":"Quentin Lance\u0027s ongoing attempt to capture the vigilante is put to a halt when a recently released criminal kidnaps his daughter to get to Arrow. Meanwhile, John Diggle insists on spying on Moira Queen to learn her secrets.","id":64125,"episode_number":13,"season_number":1,"still_path":"/5mYDymrAXFyhYiRU3D0PhOEn6Ac.jpg","vote_average":7.0},{"name":"The Odyssey","overview":"Oliver turns to Felicity for help when Moira unwittingly shoots her own son. As Oliver teeters on the verge of death, he remembers his time on the island when he teamed up with Slade Wilson to hijack a plane and escape.","id":64122,"episode_number":14,"season_number":1,"still_path":"/5mposS5Uyvy5LQ2467e2U4NN2FE.jpg","vote_average":7.0},{"name":"Dodger","overview":"A jewel thief known as Dodger targets rare gems in Starling City. Felicity convinces Oliver to go after the thief, and Oliver bugs McKenna\u0027s phone to get the information he needs to find the thief. Meanwhile, Thea runs up against a purse-snatcher and Moira asks a friend for help dealing with Malcolm.","id":64123,"episode_number":15,"season_number":1,"still_path":"/yhBTfvBNkcqhE5CPPGxB8AvsqIu.jpg","vote_average":6.5},{"name":"Dead to Rights","overview":"When Moira hires the Triad to kill Malcolm, the Triad hires Deadshot to assist them. Oliver and Diggle soon get word of the assassination attempt and end up trying to save Malcolm, unaware of his connection to the Undertaking. Meanwhile, Laurel receives an unexpected visitor.","id":64126,"episode_number":16,"season_number":1,"still_path":"/znYt4vqGxjbtQ81x9X6nV5XQCGf.jpg","vote_average":6.5},{"name":"The Huntress Returns","overview":"Helena is back to seek vengeance, but Oliver still has feeling toward her. The Arrow must stop and kill her, but at what costs? Now that several of his closest friends know about his true identity, no one is safe.","id":64127,"episode_number":17,"season_number":1,"still_path":"/leafoGxSN05EQQ1KKqIrkeLZtWX.jpg","vote_average":6.6666665},{"name":"Salvation","overview":"A new vigilante, The Savior, is capturing and executing those who he believes are preying on the people of The Glades... and Roy is his next target. Meanwhile, Moira must take drastic steps when Malcolm learns who hired his would-be assassin, and Laurel tries to discover the truth about her sister\u0027s possible survival.","id":64128,"episode_number":18,"season_number":1,"still_path":"/tdiTEl6XXCwa0qmqVMw8iUWW5iQ.jpg","vote_average":5.6666665},{"name":"Unfinished Business","overview":"A young woman who dies after an apparent drug overdose of Vertigo made a call to Tommy just before she died, and Quentin believes that he had something to do with her death. Meanwhile,Oliver tries to confirm whether The Count is behind the resurgence of Vertigo in Starling City. Meanwhile, in flashbacks, Shado puts Oliver through an unusual training exercise.","id":64129,"episode_number":19,"season_number":1,"still_path":"/oRVDDpaqA0FirNEoe7Wx3Keblwd.jpg","vote_average":6.5},{"name":"Home Invasion","overview":"When a hitman kills a couple that is going to testify against his employer, Laurel takes their young son in. She soon finds herself being stalked by the killer, and Oliver must choose whether to help her or Diggle, who is hunting down Deadshot. Meanwhile on the island, Oliver and Shado grow closer.","id":64130,"episode_number":20,"season_number":1,"still_path":"/1yeRL8ntftdM2Ly8v8B0qx9GP5S.jpg","vote_average":6.5},{"name":"The Undertaking","overview":"Diggle refuses to work with Oliver, forcing the vigilante to turn to Felicity when he needs to infiltrate a casino whose owner has information on Walter\u0027s whereabouts. Meanwhile, Tommy tells Laurel that Oliver still loves her, and in flashbacks Malcolm and Robert disagree on how to bring about The Undertaking.","id":64131,"episode_number":21,"season_number":1,"still_path":"/2TgdiYuTXfp0b9lkIK0XWNvkL.jpg","vote_average":6.5},{"name":"Darkness on the Edge of Town","overview":"As the Dark Archer, Malcolm eliminates the scientists who created the Markov Device and then ships it to Starling City to destroy The Glades. Meanwhile, Oliver, Diggle, and Felicity infiltrate Merlyn Global to learn of Malcolm\u0027s plans, and Laurel tries to resolve matters with Tommy. Five years earlier, Fyers tells his captives what his plan is for the missile launcher.","id":64132,"episode_number":22,"season_number":1,"still_path":"/dunutI6fVDy0ZUGRfxf35sgknEy.jpg","vote_average":6.5},{"name":"Sacrifice","overview":"Oliver escapes imprisonment at Malcolm\u0027s hands and races to stop his plan to level The Grades. Meanwhile, Moira makes a startling announcement, Thea looks for Roy when panic sweeps the city, and Tommy learns the truth about his father.","id":64133,"episode_number":23,"season_number":1,"still_path":"/bgXrB2ewp9HpjYMQPWHW7qp5rfh.jpg","vote_average":7.5}],"name":"Season 1","overview":"Oliver Queen returns to Starling city after being deserted on a hellish island for five years. He decides to become a mask wearing vigilante to fulfil his father\u0027s wishes and rid the city of crime. In his journey to do so, he is forced to make tough decisions even as he makes new friends and even more enemies which continue question his lethal ways of controlling crime.","id":3697,"poster_path":"/pFF8cA0M0iE61DYbNr3ntG8SmyI.jpg","season_number":1}