{"episodes":[{"name":"The Stolen Eagle","overview":"Eager to return to Rome after eight long years of war, Gaius Julius Caesar ends his campaign with a resounding triumph in Gaul, and news of a shattering personal loss at home. In Rome, Caesar\u0027s old friend Pompey is counselled by the Senate, who worry about Caesar\u0027s growing popularity. Two soldiers are enlisted to find the army\u0027s stolen gold standard. Atia is careful to play both sides of an escalating power struggle.","id":118857,"episode_number":1,"season_number":1,"still_path":"/t4iYzdEgDlfqc7k0u785NzXjvcz.jpg","vote_average":0.0},{"name":"How Titus Pullo Brought Down the Republic","overview":"Anointed People\u0027s Tribune by Caesar, Mark Antony returns to Rome with Octavian\u0027s liberators, Vorenus and Pullo. After being feted by a grateful Atia, Vorenus heads home to his family, for the first time in eight years, while Pullo heads for the brothels. Pompey drafts an ultimatum stripping the general of his power.","id":118858,"episode_number":2,"season_number":1,"still_path":"/3hVKW6anpBIsg1lk4WLjBU6XDHy.jpg","vote_average":0.0},{"name":"An Owl in a Thornbush","overview":"With Caesar quickly advancing toward Rome, Pompey begins ordering a retreat and forces his citizens to pick sides. Timon is forced to do Atia\u0027s dirty work and Vorenus cannot understand why no one is resisting while on a scouting mission.","id":118859,"episode_number":3,"season_number":1,"still_path":"/cEbqZRmKo72uUW3ymeNVq3h33S8.jpg","vote_average":0.0},{"name":"Stealing From Saturn","overview":"As Pompey \"maneuvers\" outside the city, Caesar seeks to consolidate his hold on Rome. Atia throws a party to welcome Caesar home, while Vorenus throws one of his own to usher in his new life as a citizen businessman. Pullo\u0027s run of luck continues when he delivers Quintus Pompey to Caesar, who in turn returns Quintus to his father\u0027s camp, with an offer of truce he knows Pompey will never accept.","id":118854,"episode_number":4,"season_number":1,"still_path":"/eVjANRyc2oajdgVbii5UYtwXPEE.jpg","vote_average":0.0},{"name":"The Ram Has Touched The Wall","overview":"Caesar weighs Pompey\u0027s counteroffer against Antony\u0027s recommendation to chase down Pompey\u0027s vulnerable army. Vorenus is forced to reconsider his career choices after a series of business setbacks leave him with little income to support his family. A jealous Atia concocts a clever scheme to separate Caesar from Servilia. Pullo is recruited to tutor Octavian in the art of soldiering, but ends up learning a lesson or two from the boy.","id":118855,"episode_number":5,"season_number":1,"still_path":"/tuufQMt7DMJSnZvCJAYQWOQQQGE.jpg","vote_average":0.0},{"name":"Egeria","overview":"When Caeser finds himself outnumbered by Pompey\u0027s legions, he asks Antony to join the fight. Marc Antony is having fun in his new political life while he ponders a counter-offer from Pompey. Atia urges Octavian to take another step toward manhood. Vorenus and Niobe try to bring passion back to their marriage.","id":118860,"episode_number":6,"season_number":1,"still_path":"/obKsOySzhzDNWJMYr3i631IWNz2.jpg","vote_average":0.0},{"name":"Pharsalus","overview":"Pompey attacks an outnumbered Caesar. Vorenus and Pullo are stranded at sea. Atia continues to seek out Servilla\u0027s friendship in order to ensure her protection, while Octavia and Servilla\u0027s bond grows.","id":118861,"episode_number":7,"season_number":1,"still_path":"/50G0zEtmAmSI1j7WEekBlVxbJ9c.jpg","vote_average":0.0},{"name":"Caesarion","overview":"Having pursued Pompey into Egypt, Caesar arrives in Alexandria and meets the boy king Ptolemy XIII, who offers the general a surprise gift. Vorenus and Pullo play liberators again, freeing Ptolemy\u0027s incarcerated sister, Cleopatra. Caesar seeks payment from Egypt for past debts, and ends up forging a strategic union to ensure his legacy.","id":118856,"episode_number":8,"season_number":1,"still_path":"/xxIfbbvijkgmWgfzs6XptRRd20W.jpg","vote_average":0.0},{"name":"Utica","overview":"With Scipio and Cato defeated, Caesar returns home to a hero\u0027s welcome. Vorenus and Pullo\u0027s showdown with local thug Erastes gets an unexpected reprieve from Caesar. Servilia\u0027s plan to use Octavia to unearth a secret about Caesar backfires.","id":118862,"episode_number":9,"season_number":1,"still_path":"/r0io4W1G0hAAvXeDrLT5vj3lRUL.jpg","vote_average":0.0},{"name":"Triumph","overview":"Unanimously proclaimed Dictator by the Senate, Caesar pronounces the war over, and prepares for five days of feasting and games honoring his \"triumph.\" No longer an enlisted soldier, Pullo eyes a pastoral future with Eirene, while Vorenus runs for municipal magistrate, with Posca\u0027s help. Meanwhile, Octavian retrieves Octavia from her self-imposed exile. And Servilia invites a revenge-minded Quintus Pompey into her home, to Brutus\u0027 dismay.","id":118863,"episode_number":10,"season_number":1,"still_path":"/mEMKq2X0IZCrtNviD1kJ5lGyrln.jpg","vote_average":0.0},{"name":"The Spoils","overview":"Vorenus sees to it that veteran soldiers receives severance on behalf of Caesar, and is then invited along with Niobe to one of Atia\u0027s parties.","id":118864,"episode_number":11,"season_number":1,"still_path":"/jyv2GI0ZfhtEKtCP2zfoTHr7aJq.jpg","vote_average":0.0},{"name":"Kalends of February","overview":"Pullo and Vorenus are now heroes in the eyes of the Roman rank and file because of their arena feats. This causes Caesar to bestow rewards to those he might normally punish.","id":118865,"episode_number":12,"season_number":1,"still_path":"/yJkXqyRfzAPBNWur9iGsYuqdiW6.jpg","vote_average":0.0}],"name":"Season 1","overview":"","id":5424,"poster_path":"/h6KYyzi3G2hyD3gD5DxubizeHxK.jpg","season_number":1}