{"episodes":[{"name":"Pilot","overview":"Sam is about to graduate from college and has an interview set up to join one of the most prestigious law schools in the country. His brother Dean, whom he has not seen since he went to college, shows up in the middle of the night and tells him their father is missing while on a hunting trip. Leaving his girlfriend behind to find their dad, Sam joins Dean in an effort to find their father in a little town called Jericho, where unmarried men disappear without a trace.","id":163114,"episode_number":1,"season_number":1,"still_path":"/nGUD5H2wU7bYBqpqDPTybTWunrR.jpg","vote_average":5.730769},{"name":"Wendigo","overview":"Sam and Dean pose as Park Rangers to help a brother and sister search for their lost sibling, who the Winchester brothers believe may have been taken by a Wendigo.","id":162346,"episode_number":2,"season_number":1,"still_path":"/6DfJGEww2uplM3ZE9HAMUqg7UwP.jpg","vote_average":7.0},{"name":"Dead in the Water","overview":"While going through the newspaper, Dean comes across a mysterious drowning victim. Upon further research they soon discover more people who have drowned in the same lake, but their bodies were never found. When the boys show up in town they befriend a boy whose father has drowned. The brothers come to believe the lake is haunted by a spirit.","id":162585,"episode_number":3,"season_number":1,"still_path":"/tsrvPOLdDaotybYm3eSCO5zCAch.jpg","vote_average":7.0},{"name":"Phantom Traveler","overview":"A friend of Dean\u0027s calls him up when a plane crashes under mysterious circumstances. Dean and Sam soon discover a flight attendant who was on the plane but they do not realize her full connection to the crash until they are on board another flight with her.","id":162355,"episode_number":4,"season_number":1,"still_path":"/wBYBulN95fJLOP5lixXoIMIE4F.jpg","vote_average":7.0},{"name":"Bloody Mary","overview":"A man dies of a stroke in front of a mirror but Sam and Dean believe something, or someone else, may be behind his death. Dean tries to help Sam open up about his girlfriend\u0027s death, particularly after Sam lets it slip that there\u0027s some information that he hasn\u0027t told Dean.","id":162356,"episode_number":5,"season_number":1,"still_path":"/iSsODNTSIMtbdvNpXXkPkt3TYZS.jpg","vote_average":7.0},{"name":"Skin","overview":"Sam’s friend, Zach, is accused of murder. Sam offers to help out by checking up on his sister, Rebecca. Rebecca claims her brother could not have committed the murder because he was with her at the time of the murder. But all the physical evidence points to Zach being at the scene of the crime. Could Zach have been at two places at the same time?","id":162365,"episode_number":6,"season_number":1,"still_path":"/fyCKr3B3nJejxnKsp2cOk5aOjZG.jpg","vote_average":7.0},{"name":"Hook Man","overview":"Sam and Dean help a girl whose date became a victim of the \"Hook Man,\" a famous urban legend that turns out to be real, in a small college town somewhere in Iowa. In order to save her and her father, the local minister, the brothers have to find the ghost\u0027s bones so they can destroy them. One tiny problem... they\u0027re in an unmarked grave.","id":162369,"episode_number":7,"season_number":1,"still_path":"/718cTM7yHzj3Qj02bvuhwtCCJbz.jpg","vote_average":7.0},{"name":"Bugs","overview":"Dean and Sam arrive in a town checking up a report of a mysterious death, and stop at a realtor\u0027s open house barbecue. Sam meets the realtor\u0027s son Matt, who is fascinated with bugs. Soon the town is invaded by swarms of deadly bugs, and there may be no way out.","id":162370,"episode_number":8,"season_number":1,"still_path":"/2Li4EY0ccNPyCwKmPBQ4NavS8fe.jpg","vote_average":0.0},{"name":"Home","overview":"Dean and Sam return to their home of Lawrence, Kansas, where a new family has moved into the Winchester\u0027s old home. The family begins seeing and hearing frightening things, and the brothers think it might be haunted by the thing that killed their mother.","id":162385,"episode_number":9,"season_number":1,"still_path":"/yi047DEWvXsWeGPnMyZV4L0xcch.jpg","vote_average":0.0},{"name":"Asylum","overview":"If these walls could talk. The brothers investigate a long-shuttered mental asylum that has the power to drive intruders mad... and murderous.","id":162588,"episode_number":10,"season_number":1,"still_path":"/YL7xmMPuWlZft85lQDsb0diloJ.jpg","vote_average":0.0},{"name":"Scarecrow","overview":"Sam and Dean\u0027s father sends them to a small town where the citizens sacrifice couples to a pagan god which manifests through a scarecrow.","id":162589,"episode_number":11,"season_number":1,"still_path":"/fqh61jOZlmMf5bxsWnjAzITlzX0.jpg","vote_average":0.0},{"name":"Faith","overview":"When Dean is accidentally electrocuted fighting a monster, he permanently damages his heart. When he\u0027s diagnosed as only having a month, at most, to live, Sam searches for a means to save him and finds Roy Le Grange, a faith healer who may actually be the real deal. After Le Grange heals Dean, the brothers discover that Le Grange is using black magic to bind a \"Reaper\" to do his bidding... and each healing comes with a terrible price.","id":162386,"episode_number":12,"season_number":1,"still_path":"/fCOwKMlwA15HjPvvV9YGVFlnuEp.jpg","vote_average":0.0},{"name":"Route 666","overview":"Sam and Dean head to Missouri to investigate mysterious car accidents involving black men.","id":162591,"episode_number":13,"season_number":1,"still_path":"/nVP1dEu0xSw4fV5jwlizE0dCXTP.jpg","vote_average":0.0},{"name":"Nightmare","overview":"Sam\u0027s precognitive dream leads the brothers to investigate a mysterious death which seems connected to a boy with the power of telekinesis.","id":162399,"episode_number":14,"season_number":1,"still_path":"/8oh7cOoBqZDSVgJOH3K8euALHzj.jpg","vote_average":0.0},{"name":"The Benders","overview":"Dean searches for Sam when he is kidnapped by a backwoods family who likes to hunt humans and use their body parts as trophies.","id":162598,"episode_number":15,"season_number":1,"still_path":"/fA9X8nyIxNFqMGfCRsHWv8de0wh.jpg","vote_average":0.0},{"name":"Shadow","overview":"Sam has a reunion with a girl he once met, Meg, but it turns out that she is using the brothers to lure their father John to his doom.","id":162401,"episode_number":16,"season_number":1,"still_path":"/7bXHOxR6IRvUDiUJ4brZaugihMl.jpg","vote_average":0.0},{"name":"Hell House","overview":"Sam and Dean investigate the case of a maniacal ghost inhabiting a long abandoned Texas farmhouse known as \"Hell House.\" They believe the ghost is the spirit of a deceased Depression-era farmer who killed his family, but they soon realize it is something far more powerful.","id":162400,"episode_number":17,"season_number":1,"still_path":"/5UDwyjNnus6MMCBEn5ZMCVKYMP6.jpg","vote_average":0.0},{"name":"Something Wicked","overview":"Sam and Dean battle a Shtriga, a witch that sneaks into childrens\u0027 bedrooms and sucks the lives out of them. Dean must relive his childhood when he remembers that he encountered the Shtriga years ago.","id":162392,"episode_number":18,"season_number":1,"still_path":"/hj8SJmZUFKKn0AHfeiy4BuidO2w.jpg","vote_average":0.0},{"name":"Provenance","overview":"The Winchesters must deal with a dangerous spirit bound to an old family portrait that brings misfortune and death to anyone who buys it.","id":162394,"episode_number":19,"season_number":1,"still_path":"/1LLOdZUxTP47Vb9Ye2sqo31cRv9.jpg","vote_average":0.0},{"name":"Dead Man\u0027s Blood","overview":"To obtain a mystic gun capable of destroying the demon that killed their mother, Sam and Dean must team up with their father John and face off against vampires.","id":162390,"episode_number":20,"season_number":1,"still_path":"/fm2weYzFs2PFYlMyldjo0hSAS6k.jpg","vote_average":0.0},{"name":"Salvation","overview":"John has realized where the demon will strike next and the Winchesters head there to stop the next killing. But Meg begins killing John\u0027s friends and demands the Colt or she\u0027ll keep going until everyone John knows is dead.","id":162592,"episode_number":21,"season_number":1,"still_path":"/x5XDZhKseFBfvOfJ7SL8C2td0yL.jpg","vote_average":0.0},{"name":"Devil\u0027s Trap","overview":"When Meg boasts that John is her prisoner, the boys visit a friend of their father\u0027s to get information about demonic possessions and ways to trap a demon. It turns out Meg is not what she appears.","id":162398,"episode_number":22,"season_number":1,"still_path":"/zFTdWTX0D2orgTPkPz0ITymiZ8A.jpg","vote_average":0.0}],"name":"Season 1","overview":"The Creepy. The Demented. The Unexplained. The Unearthly. Sam Winchester (Jared Padalecki) grew up hunting such terrifying things. But that’s all past. Law school beckons him. So does safety and normalcy. That is, until Sam’s estranged brother Dean (Jensen Ackles) appears with troubling news: their father has disappeared, a man who’s hunted evil for 22 years. So to find their father, the brothers must hunt what their father hunts…and Sam must return to the life he’d rather leave behind.","id":6904,"poster_path":"/mRPD2mcsB4JULEX7BLt8xrcbDhI.jpg","season_number":1}