{"episodes":[{"name":"Rites of Passage","overview":"Ragnar Lothbrok is a warrior and a farmer who dreams of finding riches by bucking the tradition.","id":892432,"episode_number":1,"season_number":1,"still_path":"/7cuiE0fvDXnCyVbQ5EXHtIz2sAr.jpg","vote_average":7.6666665},{"name":"Wrath of the Northmen","overview":"The journey west begins as Ragnar gathers a crew willing to risk their lives to travel into the unknown. Earl Haraldson\u0027s paranoia reaches new heights as his fear of Ragnar\u0027s success grows.","id":892434,"episode_number":2,"season_number":1,"still_path":"/5IN9TOLnqt9dpIC3h6xnmGNqZuz.jpg","vote_average":7.0},{"name":"Dispossessed","overview":"Ragnar and his crew return from their trip with treasure, and Earl Haraldson has no choice but to sanction another raid. The west is open for the taking, and the Vikings\u0027 world will never be the same.","id":892433,"episode_number":3,"season_number":1,"still_path":"/gUrGv5Ndr2UuHQs7xNKWm9DRUqY.jpg","vote_average":5.0},{"name":"Trial","overview":"Ragnar and his crew sail out with Earl Haraldson\u0027s permission.","id":892435,"episode_number":4,"season_number":1,"still_path":"/lmGxHLz8EExTSrN4e44g6wCnvyE.jpg","vote_average":7.0},{"name":"Raid","overview":"A seer reads Earl Haraldson\u0027s future and tells him that Ragnar searches for his death.","id":892436,"episode_number":5,"season_number":1,"still_path":"/yKgFdIa1D4X4koiNFzfxv4G5T4b.jpg","vote_average":7.5},{"name":"Burial of the Dead","overview":"Ragnar, weak and still hurt, must meet the Earl head-on after it comes to light that Rollo has been tortured on Haraldson’s orders. The two men will come together face to face with a single outcome possible: Only one man will leave this fight alive.","id":892437,"episode_number":6,"season_number":1,"still_path":"/kbcaeoP4vz6ggqFHKGPAtTBWCgr.jpg","vote_average":7.0},{"name":"A King\u0027s Ransom","overview":"Three Viking ships sail toward the Royal Villa of King Aelle in eastern England. Ragnar wants ransom in exchange for peace, but the king has a very different plan in mind.","id":892438,"episode_number":7,"season_number":1,"still_path":"/tJFeOQIcK7BCBbMmGTqO9FF9noi.jpg","vote_average":7.5},{"name":"Sacrifice","overview":"The traditional pilgrimage to Uppsala to thank the gods brings a torrent of emotions for Ragnar, Lagertha, and Athelstan. Ragnar, pulling farther away from his wife goes to make peace with the death of his unborn son. Lagertha, still reeling from her miscarriage, wants to find out from the gods if more sons are in her future. As the Vikings come together to sacrifice and give thanks to their gods, Athelstan discovers just how strong his Christian faith still is.","id":892439,"episode_number":8,"season_number":1,"still_path":"/z8sDwBSk48Al52CdA9u4vnPvWJQ.jpg","vote_average":7.0},{"name":"All Change","overview":"Ragnar travels to Götaland to help King Horik resolve a land dispute with the area\u0027s leader, Jarl Borg. Meanwhile, sickness infects the village of Kattegat, and the people look to Lagertha to help them appease the gods.","id":892440,"episode_number":9,"season_number":1,"still_path":"/oyNW4u6DhkaF9m44RXo3Lwwc0WC.jpg","vote_average":7.5}],"name":"Season 1","overview":"","id":53334,"poster_path":"/uYaskJzmBhBdvkitDTjlH6gj9Pt.jpg","season_number":1}