{"episodes":[{"name":"Pilot","overview":"Jay has just recently married his younger, Colombian wife, Gloria, but he\u0027s having trouble keeping up with her and her son Manny. Claire is having trouble with her own family, especially with her husband Phil, who thinks he can be hip with his three kids. Also, Mitchell and his partner Cameron adopt a Vietnamese baby, Lily.","id":64965,"episode_number":1,"season_number":1,"still_path":"/zJeQFHYYu8XHMk5JbWPXJ4Vgo7U.jpg","vote_average":7.5},{"name":"The Bicycle Thief","overview":"Phil is determined to help Luke prove to mom that he is responsible  enough to have the brand new bike they just got him. However Phil ends  up being the irresponsible one when a hot neighbor clouds his judgment.  Meanwhile Mitchell and Cameron take Lily to their first Mommy \u0026amp; Me  class, and Jay and Manny have some awkward father and son time.","id":64966,"episode_number":2,"season_number":1,"still_path":"/xzydcqxzJXs3hZlQYjSNBzSsv5p.jpg","vote_average":0.0},{"name":"Come Fly with Me","overview":"Phil pushes Jay to go out with him and fly his new model plane. While Manny takes time out to play with Luke, Gloria accompanies Alex in shopping for a dress. Later on, Manny ends up having a heart-to-heart talk with his sister Claire.","id":64954,"episode_number":3,"season_number":1,"still_path":"/vdX9s2SocVArXs64fMPUU9qKymP.jpg","vote_average":0.0},{"name":"The Incident","overview":"Claire and Mitchell\u0027s mother, Dede, drops in for a surprise visit and is determined to make amends with everyone she offended during what has been deemed \"the incident\" at Jay and Gloria\u0027s wedding. Needless to say, no one is thrilled to see her and everything comes to a head when the whole family shows up to dinner at Claire\u0027s house.","id":64969,"episode_number":4,"season_number":1,"still_path":"/vKkVu42KFX2JEKe9BxeptXF4VAB.jpg","vote_average":0.0},{"name":"Coal Digger","overview":"The whole family is invited to Jay and Gloria\u0027s for some barbeque and  football. However an earlier incident at school between Manny and Luke  makes things very awkward for Gloria and Claire, and then things  escalate when a not-so-flattering label is uttered.","id":64953,"episode_number":5,"season_number":1,"still_path":"/2N4Tntlp4reolWUZXG6e5dO99xi.jpg","vote_average":0.0},{"name":"Run for Your Wife","overview":"It\u0027s the first day back at school for the kids and, at the Dunphy house,  Phil oversteps when he misreads how Claire is coping with an empty  nest. Over at Jay\u0027s, he and Gloria are in disagreement over Manny\u0027s  interesting choice of outfit for his first day of class, and Mitchell  and Cameron freak out after Lily gets her first bump on the head.","id":64968,"episode_number":6,"season_number":1,"still_path":"/3zCXz3F18HeN0YTvcffX8Kubv0y.jpg","vote_average":0.0},{"name":"En Garde","overview":"The whole family comes out to support Manny\u0027s newfound interest - fencing. It turns out he\u0027s quite masterful in the sport, but Jay\u0027s proud enthusiasm triggers an old childhood wound for Mitchell. Meanwhile Phil is determined to find where Luke\u0027s hidden talents lie.","id":64970,"episode_number":7,"season_number":1,"still_path":"/jUAagTjiWQVXi4qZ9tUszOgUB2z.jpg","vote_average":0.0},{"name":"Great Expectations","overview":"With a history of giving bad gifts, Claire is determined to surprise Phil with an amazing anniversary present: a private performance by one of their favorite musicians, Izzy LaFontaine. However, it turns out to be unexpected in more ways than one. Meanwhile, Mitchell and Cameron call up their \"party-girl bestie\", Sal, for a long overdue night out on the town.","id":64967,"episode_number":8,"season_number":1,"still_path":"/bO1yj5bjmBKin8bkpCHbk7aP9Md.jpg","vote_average":0.0},{"name":"Fizbo","overview":"Nothing is too big when Phil and Claire decide to throw Luke the biggest and best birthday party a boy could ever want, but when Cameron shows up as Fizbo the Clown, it sets off a chain of events that ends with someone in the hospital.","id":64975,"episode_number":9,"season_number":1,"still_path":"/rLFfx4omjWqSPMAHRUkGNEnM8EA.jpg","vote_average":0.0},{"name":"Undeck the Halls","overview":"Christmas is in full swing at the Dunphy house until the kids get in  some trouble and Phil and Claire threaten to take away Christmas until  one of them fesses up. Meanwhile, Jay struggles with wanting to stick to  his holiday traditions while Gloria and Manny want to incorporate some  of their Colombian practices, and Mitchell and Cameron take Lily to the  mall for her first picture with Santa -- but end up with a disgruntled  mall Santa on their hands.","id":64958,"episode_number":10,"season_number":1,"still_path":"/hz9nZyJB8bEGMo6gYZg953lpE6D.jpg","vote_average":0.0},{"name":"Up All Night","overview":"Gloria is less than pleased with Jay\u0027s reaction to the arrival of  Javier, Manny\u0027s infamously unreliable dad. Meanwhile, Phil is suffering  from kidney stones and his dramatics leave Claire no other choice but to  call for the hot firemen to rush him to the hospital, and Mitchell and  Cameron have a harder time than Lily as they attempt to sleep train her.","id":64971,"episode_number":11,"season_number":1,"still_path":"/k9lHwARmJYyB6uIedVy1U1BMpMk.jpg","vote_average":0.0},{"name":"Not In My House","overview":"When Claire finds a dirty picture on the computer and assumes it\u0027s  Luke\u0027s doing, a guilty Phil doesn\u0027t necessarily correct her. Jay and  Gloria disagree over his beloved life-sized dog butler statue, and  Cameron gets sucked into their gardener\u0027s woes, much to Mitchell\u0027s  chagrin.","id":64972,"episode_number":12,"season_number":1,"still_path":"/yTGlqa9OVe9XZ1TjDhBS4rioYGO.jpg","vote_average":0.0},{"name":"Fifteen Percent","overview":"Mitchell plants the seed in Jay\u0027s head that he thinks one of Jay\u0027s old buddies might be secretly gay. Jay doesn\u0027t believe it for a second... except for all the questionable signs he now keeps noticing. Meanwhile Gloria gives Manny\u0027s date a makeover and Claire faces off with Phil\u0027s universal remote.","id":64974,"episode_number":13,"season_number":1,"still_path":"/9kKPgCQnaUXzGAbJOF4XdVdAKyR.jpg","vote_average":0.0},{"name":"Moon Landing","overview":"Claire is upset to find that her friend Valerie is better than her. In the meantime Mitchell helps Gloria with legal issues and Jay had a hard time in the locker room.","id":64973,"episode_number":14,"season_number":1,"still_path":"/y5rAQK5SoomLFsGOlr5qF3OxEo3.jpg","vote_average":0.0},{"name":"My Funky Valentine","overview":"Phil and Claire break from their traditional Valentine\u0027s Day dinner date and plan a little \"role play\" excursion. Meanwhile, Jay and Gloria\u0027s ideas of romance clash when he takes her to a comedy show, and Mitchell and Cameron play cupid for Manny.","id":64957,"episode_number":15,"season_number":1,"still_path":"/5zX7V8xAfw0OlMkgTuTJb3Ap4zH.jpg","vote_average":0.0},{"name":"Fears","overview":"Phil and Luke go into crawlspace under the house, Hayley takes her drivers test, Manny tries to get over his fear of roller coasters and Lily says \"Mommy\" which upsets Cameron and Mitchell.","id":64961,"episode_number":16,"season_number":1,"still_path":"/wmJofxnmA9fHwfGGlNPHdjwAPQt.jpg","vote_average":0.0},{"name":"Truth Be Told","overview":"Phil meets an old girlfriend on Facebook. Jay accidentally kills Manny\u0027s turtle. Mitchell tells his boss the truth.","id":64960,"episode_number":17,"season_number":1,"still_path":"/xLhrXMSbQE32rJjgkRIzKhKQc84.jpg","vote_average":0.0},{"name":"Starry Night","overview":"Jay and Mitchell go on their traditional father-and-son outing to see the meteor showers, but Mitchell is upset when he finds out that Manny will be joining them. Cameron and Gloria spend some quality time together, with some minor incidents, while Phil and Claire both take on one of their child\u0027s school projects.","id":64952,"episode_number":18,"season_number":1,"still_path":"/5xIs7WVo0vT7qkEfTisXKUoESOC.jpg","vote_average":0.0},{"name":"Game Changer","overview":"iPad release day falls on Phil\u0027s birthday, giving Claire an opportunity to finally score an ideal gift for her technophile husband. Manny and Gloria humor Jay—a sore loser at board games—by suppressing their superior chess skills. Mitchell questions his ability to protect his family, while crossed baby monitor signals compel Cameron to secretly intervene in the love life of a neighboring couple.","id":64956,"episode_number":19,"season_number":1,"still_path":"/7RkdpwSXrkW78Rg2KlnbMNpBxvF.jpg","vote_average":0.0},{"name":"Benched","overview":"During an intense basketball game, Luke and Manny\u0027s coach quits, which leads to Jay and Phil stepping in to help out. Meanwhile, Mitchell helps Cameron find a prospective employer.","id":64964,"episode_number":20,"season_number":1,"still_path":"/9tXtDnXHYYrm6PHDtZ2peWP8LfE.jpg","vote_average":0.0},{"name":"Travels with Scout","overview":"Claire is caught off guard when Phil\u0027s father shows up in an RV with a little four legged friend, and she becomes suspicious that he might be hiding a larger reason for the visit. Meanwhile, when Cameron hears Dylan is down a drummer in his band, he enthusiastically offers to fill in, and Jay and Gloria have to pay the consequences of accidentally taking Manny to see a traumatizing horror movie.","id":64955,"episode_number":21,"season_number":1,"still_path":"/fyPUMtciPbwo3MqI67qQPYOCzbp.jpg","vote_average":0.0},{"name":"Airport 2010","overview":"For Jay\u0027s birthday, Gloria gives him the best surprise -- a romantic birthday getaway to Hawaii -- the only kicker is she invited the whole entire family to come along. Everyone arrives at the airport, and it\u0027s a maddening scene with forgotten I.D.\u0027s, security breaches and flying phobias.","id":64959,"episode_number":22,"season_number":1,"still_path":"/vaCgitgsAQGdj85kvgvBsCVJa9Z.jpg","vote_average":0.0},{"name":"Hawaii","overview":"Jay\u0027s plans to do nothing but relax on vacation are interrupted by an unwelcome reality check. Meanwhile, Phil tries to make the trip romantic for Claire, Mitchell and Cameron disagree on whether they should go sight-seeing, and the kids get themselves into trouble.","id":64962,"episode_number":23,"season_number":1,"still_path":"/jLdvsMR6YSWTIqxxZuMBa5GOJwO.jpg","vote_average":0.0},{"name":"Family Portrait","overview":"Claire makes an effort to take a new family portrait, but everybody is too busy to cooperate: Gloria and Manny go with Phil and Alex to a Lakers game and share an awkward moment on the jumbotron, Cameron gets a job as a wedding singer while Mitchell takes care of Lilly and a stray pigeon, and Luke interviews Jay for a school project.","id":64963,"episode_number":24,"season_number":1,"still_path":"/72Q8sYv5I73nenDX7em1VWsTeQg.jpg","vote_average":0.0}],"name":"Season 1","overview":"The first season of the television comedy series Modern Family aired between September 23, 2009 and May 19, 2010, on ABC in the United States. The season was produced by 20th Century Fox Television and Lloyd-Levitan Productions with series creators Christopher Lloyd and Steven Levitan as executive producers.\n\nThe series focuses on Jay Pritchett, his daughter Claire Dunphy, and his son Mitchell Pritchett who live in Los Angeles. Claire is a homemaker mom married to Phil Dunphy; they have three children. Jay is married to a much younger Colombian woman, Gloria, and is helping her raise her pre-teen son, Manny. Mitchell and his partner Cameron Tucker have adopted a Vietnamese baby, Lily. Season one of Modern Family aired Wednesdays in the United States at 9 p.m. and consisted of 24 episodes.\n\nThe season received critical acclaim from most critics, many of whom named it the best new show of 2009. The episode \"Fizbo\" received overwhelmingly positive reviews from critics, with BuddyTV naming it the second best show of 2009. It was nominated for 14 Emmy Awards; eight Primetime Emmy Awards and six Creative Arts Emmy Awards, the most nominations for a comedy series after Glee and 30 Rock. The series was also a ratings success and the first season averaged 9.39 million viewers for all 24 episodes. The ratings led to ABC renewing the series for a second season mid-way through the first. The first season DVD and Blu-ray Disc box set was released on September 21, 2010.","id":3751,"poster_path":"/9rvolF2UCFOSzh9PqozokcVe7XO.jpg","season_number":1}