{"episodes":[{"name":"Winter Is Coming","overview":"Jon Arryn, the Hand of the King, is dead. King Robert Baratheon plans to ask his oldest friend, Eddard Stark, to take Jon\u0027s place. Across the sea, Viserys Targaryen plans to wed his sister to a nomadic warlord in exchange for an army.","id":63056,"episode_number":1,"season_number":1,"still_path":"/wrGWeW4WKxnaeA8sxJb2T9O6ryo.jpg","vote_average":8.125},{"name":"The Kingsroad","overview":"While Bran recovers from his fall, Ned takes only his daughters to Kings Landing. Jon Snow goes with his uncle Benjen to The Wall. Tyrion joins them.","id":63057,"episode_number":2,"season_number":1,"still_path":"/icjOgl5F9DhysOEo6Six2Qfwcu2.jpg","vote_average":7.375},{"name":"Lord Snow","overview":"Lord Stark and his daughters arrive at King\u0027s Landing to discover the intrigues of the king\u0027s realm.","id":63058,"episode_number":3,"season_number":1,"still_path":"/4vCYVtIhiYSUry1lviA7CKPUB5Z.jpg","vote_average":6.875},{"name":"Cripples, Bastards, and Broken Things","overview":"Eddard investigates Jon Arryn\u0027s murder. Jon befriends Samwell Tarly, a coward who has come to join the Night\u0027s Watch.","id":63059,"episode_number":4,"season_number":1,"still_path":"/a4tO7cgpv9IkatqAsv5k20zzlyi.jpg","vote_average":8.3},{"name":"The Wolf and the Lion","overview":"Catelyn has captured Tyrion and plans to bring him to her sister, Lysa Arryn, at The Vale, to be tried for his, supposed, crimes against Bran. Robert plans to have Daenerys killed, but Eddard refuses to be a part of it and quits.","id":63060,"episode_number":5,"season_number":1,"still_path":"/qS3CHz3AKaC6WhlxQuEXPdrEPjg.jpg","vote_average":7.25},{"name":"A Golden Crown","overview":"While recovering from his battle with Jamie, Eddard is forced to run the kingdom while Robert goes hunting. Tyrion demands a trial by combat for his freedom. Viserys is losing his patience with Drogo.","id":63061,"episode_number":6,"season_number":1,"still_path":"/AqtTrDIHKB6USFUUxLiIWJ6LTes.jpg","vote_average":6.375},{"name":"You Win or You Die","overview":"Robert has been injured while hunting and is dying. Jon and the others finally take their vows to the Night\u0027s Watch. A man, sent by Robert, is captured for trying to poison Daenerys. Furious, Drogo vows to attack the Seven Kingdoms.","id":63062,"episode_number":7,"season_number":1,"still_path":"/l0d3WVs99QZPoxrOGuk21mV5NSp.jpg","vote_average":8.125},{"name":"The Pointy End","overview":"Eddard and his men are betrayed and captured by the Lannisters. When word reaches Robb, he plans to go to war to rescue them. The White Walkers attack The Wall. Tyrion returns to his father with some new friends.","id":63063,"episode_number":8,"season_number":1,"still_path":"/9ZvT1IZPcC11eiCByOzqQvC3CCR.jpg","vote_average":7.0},{"name":"Baelor","overview":"Robb goes to war against the Lannisters. Jon finds himself struggling on deciding if his place is with Robb or the Night\u0027s Watch. Drogo has fallen ill from a fresh battle wound. Daenerys is desperate to save him.","id":63064,"episode_number":9,"season_number":1,"still_path":"/41zQhAxoccalbhcd1udPIPJVTt1.jpg","vote_average":8.1},{"name":"Fire and Blood","overview":"With Ned dead, Robb vows to get revenge on the Lannisters. Jon must officially decide if his place is with Robb or the Night\u0027s Watch. Daenerys says her final goodbye to Drogo.","id":63065,"episode_number":10,"season_number":1,"still_path":"/88loh1qyi8vwJO8qH1SdQRsHKNI.jpg","vote_average":8.083333}],"name":"Season 1","overview":"The first season of the epic fantasy television drama series Game of Thrones premiered on HBO on April 17, 2011, and concluded on June 19, 2011, airing on Sunday at 9:00 pm in the United States. It consisted of 10 episodes, each running approximately 55 minutes in length. Game of Thrones is based on the novel A Game of Thrones, the first entry in A Song of Ice and Fire series by George R. R. Martin. The story takes place in a fictional world, primarily upon a continent called Westeros. The noble House Stark, led by Lord Eddard \"Ned\" Stark is drawn into schemes against King Robert Baratheon when the Hand of the King Jon Arryn dies mysteriously.","id":3624,"poster_path":"/zwaj4egrhnXOBIit1tyb4Sbt3KP.jpg","season_number":1}