{"episodes":[{"name":"City of Heroes","overview":"Barry discovers his powers and puts them to the test, only when he finds its no longer a test but the real thing when he encounters a certain someone.","id":977122,"episode_number":1,"season_number":1,"still_path":"/i4eBf15GpOgFoiBo4tFRfvkoTYO.jpg","vote_average":7.1875},{"name":"Fastest Man Alive","overview":"Barry changes into the Flash when six gunmen storm a university event honoring a scientist, but his heroics don\u0027t match up to his expectations. Meanwhile, Iris becomes even more intrigued by the \"red streak.\"","id":1005650,"episode_number":2,"season_number":1,"still_path":"/tM61prhWhwHNDYAybsHAgRJbUZk.jpg","vote_average":7.7},{"name":"Things You Can\u0027t Outrun","overview":"Barry and the team go after the Mist, who possesses toxic gas powers, and they reflect on the night Caitlin\u0027s fiancé died. Meanwhile, Henry gets a long-awaited visit from Joe, and Iris and Eddie continue to keep their romance a secret from Joe.","id":1005651,"episode_number":3,"season_number":1,"still_path":"/wY1omkKIuqZILjniPssbGlfZ0NY.jpg","vote_average":6.9},{"name":"Going Rogue","overview":"The Flash battles Captain Cold after the villain is involved in a robbery and plots to steal the Kahndaq Dynasty Diamond.","id":1005652,"episode_number":4,"season_number":1,"still_path":"/flWYU25xy3KM5XxihrDV0cGvscp.jpg","vote_average":6.5},{"name":"Plastique","overview":"After a bomb explodes downtown, the army rolls in and takes over. When Joe learns Iris is writing about \u0027The Streak\u0027 and tries unsuccessfully to have the story stopped, Barry decides to have The Flash pay her a visit.","id":1010677,"episode_number":5,"season_number":1,"still_path":"/liqmjK7src8zxUWnpzXjctKPund.jpg","vote_average":7.0833335},{"name":"The Flash is Born","overview":"The Flash faces a new meta-human named Tony, who can turn himself into girded steel at will.","id":1010678,"episode_number":6,"season_number":1,"still_path":"/kutIsg0hrxFnsOTg3w8eqbCxjkn.jpg","vote_average":7.6},{"name":"Power Outage","overview":"The Flash goes up against Farooq aka Blackout, a metahuman who can harness electricity.","id":1010679,"episode_number":7,"season_number":1,"still_path":"/6RqDA0k2dcRTRcppZybXH14YJ6F.jpg","vote_average":7.4},{"name":"Flash vs. Arrow","overview":"Barry is thrilled when Oliver, Felicity and Diggle come to Central City to investigate a case involving a deadly boomerang.","id":1010680,"episode_number":8,"season_number":1,"still_path":"/farB7p2uU1SdFHbHLOvOxMFrdrA.jpg","vote_average":8.2},{"name":"The Man in the Yellow Suit","overview":"Barry enjoys the annual tradition of tree trimming and gift exchange with Joe and Iris. He gives Iris a touching gift, but the moment is interrupted by Eddie’s arrival.","id":1018354,"episode_number":9,"season_number":1,"still_path":"/oOxyoygvlqgWlapCfL7vtEaQqx4.jpg","vote_average":8.0},{"name":"Revenge of the Rogues","overview":"While Barry strives to become fast enough to defeat Reverse-Flash, Captain Cold returns to Central City with a partner and takes Caitlin hostage to force a confrontation with the Flash.","id":1018355,"episode_number":10,"season_number":1,"still_path":"/AeqQiAxUWy3JwMqZyhwMwId7oSn.jpg","vote_average":7.6},{"name":"The Sound and the Fury","overview":"Dr. Wells\u0027 former protégé, Hartley Rathaway, returns to seek revenge on his mentor. Meanwhile, Iris is hired as a cub reporter; Cisco recalls his first day on the job at S.T.A.R. Labs; and Joe asks Eddie for a favor but asks him to keep it a secret from Barry.","id":1037712,"episode_number":11,"season_number":1,"still_path":"/3ekYsmDkO7BSXxas7A4FFe9UP6A.jpg","vote_average":5.875},{"name":"Crazy for You","overview":"Caitlin takes Barry out to a local karaoke bar to help them both find new loves. Caitlin strikes out but Barry meets a sports reporter and asks her out for a date. Meanwhile, Cisco considers Hartley\u0027s dangerous offer; and the team search for Shawna, a meta-human with teleportation powers who just busted her boyfriend out of Iron Heights.","id":1037713,"episode_number":12,"season_number":1,"still_path":"/9GTxC5Ke8hhgmrrHiido13fdoy6.jpg","vote_average":6.375},{"name":"The Nuclear Man","overview":"While Barry, Harrison, and Caitlin hunt down Ronnie, who has attacked a man, Joe recruits Cisco to help him learn the truth about who murdered Nora Allen.","id":1037714,"episode_number":13,"season_number":1,"still_path":"/usjv8RAbnWy57d3KeChLLXCWoqH.jpg","vote_average":6.375},{"name":"Fallout","overview":"Martin and Ronnie are separated, only to realize that they must learn how to rejoin before Eiling hunts them down and kills them... and the Flash. Meanwhile, Joe shows Barry the 3D images from the Nora Allen crime scene, and Barry asks Martin for advice on time travel.","id":1039988,"episode_number":14,"season_number":1,"still_path":"/5SYE3YeMK5RQ4FGSn6XstlPTVoS.jpg","vote_average":6.375},{"name":"Out of Time","overview":"Mark Mardon, having survived his apparent death during the black-matter explosion, returns seeking revenge on Joe for the death of his brother Clyde... and has the same weather-manipulation powers as his deceased sibling.","id":1039989,"episode_number":15,"season_number":1,"still_path":"/3ecwKLunVv2s8KFC9mt8NZe5jS6.jpg","vote_average":7.625},{"name":"Rogue Time","overview":"The Flash learns that Captain Cold and Heat Wave have returned to Central City. This time Snart has brought along his baby sister Lisa to help wreak havoc on the city.","id":1039990,"episode_number":16,"season_number":1,"still_path":"/vHHDxtMAH4PDICRxuDxUsxhdJGf.jpg","vote_average":4.875},{"name":"Tricksters","overview":"When a villain calling himself the Trickster runs rampant in Central City, Joe and Barry go to Iron Heights to talk with the original Trickster.","id":1039991,"episode_number":17,"season_number":1,"still_path":"/a4OayTfzogEzIc72sK4hBcVaFrC.jpg","vote_average":7.75},{"name":"All-Star Team Up","overview":"Felicity and Ray Palmer pay a visit to S.T.A.R. Labs for help getting Ray\u0027s ATOM suit to work, and ask Cisco for help. Meanwhile, a young tech expert raises havoc with her insect drones, and Barry asks Ray for help dealing with her.","id":1047470,"episode_number":18,"season_number":1,"still_path":"/wJsNeIPjZggLm98SCidiGX7khbU.jpg","vote_average":6.25},{"name":"Who Is Harrison Wells?","overview":"Joe and Cisco go to Starling City to ask Quentin Lance for his help investigating the site of Harrison\u0027s car accident 15 years ago and determining what really happened. Meanwhile, Eddie is framed for a shooting by a shapeshifing metahuman who can take on the appearance of anyone he touches.","id":1051229,"episode_number":19,"season_number":1,"still_path":"/vkGMU9ZErxd333GXNG3u0sEPIjk.jpg","vote_average":7.625},{"name":"The Trap","overview":"Barry, Caitlin, Cisco and Joe set a trap for Wells. Cisco uses himself as prey which puts him in grave danger. Meanwhile, Eddie makes a decision regarding Iris, which leaves Joe a bit unsettled. ","id":1051230,"episode_number":20,"season_number":1,"still_path":"/v8SZlqJ1amvCuh5yMo0t7pcjzyM.jpg","vote_average":6.75},{"name":"Grodd Lives","overview":"While Barry tries to find Eddie, a mysterious mind-controlled thief launches attacks on Central City\u0027s gold reserves. The team soon discovers that a telepathic gorilla is behind the robberies... and is following Harrison\u0027s commands. Meanwhile, Iris confronts Barry, while Harrison prepares to return home.","id":1051231,"episode_number":21,"season_number":1,"still_path":"/3EQ0MaRUkt0GxZP8Lzh5Po4fxad.jpg","vote_average":6.1666665},{"name":"Rogue Air","overview":"When Harrison activates the particle accelerator, the team has no choice but to evacuate the five metahuman prisoners. Unfortunately, with time running out, Barry has no choice but to turn to Captain Cold for help. Meanwhile, Eddie escapes but has some surprising news for Iris.","id":1051232,"episode_number":22,"season_number":1,"still_path":"/duURv7F1POR2OKh8TgVpSGvvhoN.jpg","vote_average":8.125},{"name":"Fast Enough","overview":"Wells presents Barry with a life-changing choice. Dr. Martin Stein and Ronnie Raymond return to help the S.T.A.R. Labs team with this final fight.","id":1051233,"episode_number":23,"season_number":1,"still_path":"/aepBBreYvTwsaGuqOygBgsYs4n.jpg","vote_average":7.6666665}],"name":"Season 1","overview":"","id":60523,"poster_path":"/hJysBrladxYuP5065vCAf91KcyB.jpg","season_number":1}