{"episodes":[{"name":"Pilot","overview":"Detective Sherlock Holmes, along with his sober companion, Dr. Joan Watson, uses his uncanny ability to read people and analyze crimes to assist the NYPD on some of their more difficult cases. In the season premiere, Holmes consults on a home invasion that resulted in murder.","id":64286,"episode_number":1,"season_number":1,"still_path":"/14PEsYWrZGYaQONPxQHaHjqufK5.jpg","vote_average":0.0},{"name":"While You Were Sleeping","overview":"Sherlock uses his powers of deduction to consult on the murder of a young man who is shot upon entering his apartment. Meanwhile, Watson has dinner with her ex-boyfriend, Ty Morstan.","id":64287,"episode_number":2,"season_number":1,"still_path":"/hmS5qHaDWQCk1QwVi5f6w9ZD3ir.jpg","vote_average":0.0},{"name":"Child Predator","overview":"Sherlock and Watson consult on a child abduction case involving a serial killer who is nicknamed \"The Balloon Man,\" because he leaves a signature batch of balloons at each of his crime scenes.","id":64309,"episode_number":3,"season_number":1,"still_path":"/pJG7Edkc94e9eAfJFqVNsZ29hcG.jpg","vote_average":0.0},{"name":"The Rat Race","overview":"When Sherlock investigates what appears to be a series of murders at a top Wall Street firm, he may himself fall afoul of a sociopathic slayer.","id":64288,"episode_number":4,"season_number":1,"still_path":"/fWngok4KSSFQJleSeEGCWj94XZg.jpg","vote_average":0.0},{"name":"Lesser Evils","overview":"Sherlock tries to determine who has been killing weak and terminal patients at a hospital, making it look like they died of natural causes. Meanwhile, Sherlock learns more about Joan’s decision to walk away from her surgical career.","id":64289,"episode_number":5,"season_number":1,"still_path":"/xvtdwBxygSez3WxND7pgSFGBUy.jpg","vote_average":0.0},{"name":"Flight Risk","overview":"When Gregson learns that a serial slayer he put away 13 years ago may actually be innocent, he faces a career-destroying scandal -- unless Sherlock can ultimately prove it was a righteous bust.","id":64290,"episode_number":6,"season_number":1,"still_path":"/ioKjt2u6bwkWyxucFvaWcDZQtLE.jpg","vote_average":9.0},{"name":"One Way to Get Off","overview":"Sherlock assists with a double homicide that has the same M.O. as a series of murders that took place 13 years ago. Meanwhile, after being frozen out by Sherlock, Watson visits his old rehab center in order to learn more about the mysterious man in her care.","id":64291,"episode_number":7,"season_number":1,"still_path":"/w7mryu8EKDTRR91RpOthjPWq9If.jpg","vote_average":8.0},{"name":"The Long Fuse","overview":"While investigating an explosion that kills two people, Sherlock discovers a crime that’s been lying dormant for years. Meanwhile, Watson encourages Sherlock to finally pick a sponsor.","id":64293,"episode_number":8,"season_number":1,"still_path":"/1Fl4FMWvv5oQp9eRAGNRvMdv3U3.jpg","vote_average":0.0},{"name":"You Do It To Yourself","overview":"Sherlock uses his trademark deductive reasoning skills to find the killer of a college professor, Meanwhile, Watson gets a call from a former lover who needs her help.","id":64292,"episode_number":9,"season_number":1,"still_path":"/rVIZySNRiXZknVl9vkoiVTtfmU9.jpg","vote_average":9.0},{"name":"The Leviathan","overview":"Sherlock is called in to investigate when a supposedly uncrackable bank vault called “The Leviathan” is breached. Meanwhile, Joan is pleasantly surprised when Sherlock meets her family and defends her choice to become a sober companion.","id":64294,"episode_number":10,"season_number":1,"still_path":"/7M6zcXf94M8KYVrfPnuwGAs8lQQ.jpg","vote_average":0.0},{"name":"Dirty Laundry","overview":"Sherlock and Joan investigate the murder of the general manager of a high-end Manhattan hotel whose body is found inside an industrial laundry machine. Meanwhile, since Joan’s time with Sherlock is almost up, he offers her an apprenticeship.","id":64295,"episode_number":11,"season_number":1,"still_path":"/3LsdjJ7x5cvHKSqNnPtCgjVEFUB.jpg","vote_average":0.0},{"name":"M.","overview":"Sherlock is reunited with “M.” a British criminal who appears to have followed Sherlock to New York. Meanwhile, Joan has reservations about leaving Sherlock and taking on a new client.","id":64296,"episode_number":12,"season_number":1,"still_path":"/eCoXW6FssinO1CGAbW0iLQ7MiNd.jpg","vote_average":9.0},{"name":"The Red Team","overview":"While on suspension from the NYPD, Sherlock investigates a suspicious hit-and-run accident involving a conspiracy theorist. Meanwhile, Watson tries to broker peace between Sherlock and Gregson.","id":64299,"episode_number":13,"season_number":1,"still_path":"/qpAzjrHYNH6ErTsxi91t7wqdDfJ.jpg","vote_average":9.0},{"name":"The Deductionist","overview":"Sherlock pursues Martin Ennis, an unpredictable criminal, before he strikes again. During the investigation, Sherlock is forced to work alongside Kathryn Drummond, the FBI profiler who literally wrote the book on Ennis. Meanwhile, Watson faces eviction from her apartment.","id":64298,"episode_number":14,"season_number":1,"still_path":"/oiIba9sZZk5eK9mKAhLdfWXReKf.jpg","vote_average":0.0},{"name":"A Giant Gun, Filled with Drugs","overview":"When Sherlock\u0027s ex-drug dealer, Rhys, comes around for help, Watson is concerned about Sherlock\u0027s sobriety after Rhys implies that Sherlock on drugs made a better detective.","id":64297,"episode_number":15,"season_number":1,"still_path":"/h56n3SXmfeZrSGXkLrhRZu4N95d.jpg","vote_average":0.0},{"name":"Details","overview":"Sherlock investigates what he believes will be an open-and-shut case after Detective Bell is attacked. However, the case takes an unexpected turn when the suspected assailant is found dead. Meanwhile, Sherlock encourages Joan to learn self-defense.","id":64301,"episode_number":16,"season_number":1,"still_path":"/p2gikNMFAMyn1sYRgoQotN07DcO.jpg","vote_average":0.0},{"name":"Possibility Two","overview":"Sherlock investigates a case involving a wealthy philanthropist who believes his incurable illness was given to him on purpose. Meanwhile, Sherlock tries to teach Joan his deductive skills by sending her to a suspicious dry cleaning establishment.","id":64300,"episode_number":17,"season_number":1,"still_path":"/vKWjyv5y8yAaKlnGulw8eHYaitn.jpg","vote_average":9.0},{"name":"Déjà Vu All Over Again","overview":"Joan investigates her first solo case when a wife disappears. The missing woman left behind a tear-filled video that mentions a murder on a subway platform. While Joan searches for the vanished lady, Sherlock probes the murder.","id":64302,"episode_number":18,"season_number":1,"still_path":"/8njtEBIi7sKL7T9IjmcQzTkHHf0.jpg","vote_average":9.0},{"name":"Snow Angels","overview":"Sherlock and Joan try to prevent the largest cash vault in the U.S. from being robbed during a deadly blizzard. Meanwhile, Holmes attempts to help a transgender woman who is recovering from her latest breakup.","id":64303,"episode_number":19,"season_number":1,"still_path":"/lWxE60drq4ePgzF4oYzTZbRc2tt.jpg","vote_average":8.0},{"name":"Dead Man\u0027s Switch","overview":"Sherlock and Joan hunt for the accomplice of a murdered blackmailer who targeted families of rape victims. Meanwhile, Sherlock resists celebrating his first year of sobriety.","id":64308,"episode_number":20,"season_number":1,"still_path":"/mdNq0A2ObvjUNAXnEbzYjv0J5Rt.jpg","vote_average":9.0},{"name":"A Landmark Story","overview":"Sherlock resumes his hunt for Moriarty when Sebastian Moran reveals that a man who was thought to be dead from a heart attack was actually on the list of intended victims from Moriarty.","id":64304,"episode_number":21,"season_number":1,"still_path":"/pp7opbfGhZVvLMEEuWDzQQ1nWHn.jpg","vote_average":9.0},{"name":"Risk Management","overview":"Sherlock agrees to take a case from a man claiming to be Moriarty, hoping it will bring him closer to finding his nemesis. Meanwhile, Gregson encourages Joan to give up the dangerous line of work she has chosen and go back to being a sober companion.","id":64307,"episode_number":22,"season_number":1,"still_path":"/nkIO2r97eyuje2vA9wTGwee5t6e.jpg","vote_average":10.0},{"name":"The Woman","overview":"As Sherlock reels at the reappearance of his former lover, Irene Adler, a series of flashbacks unravel the tumultuous events that led to his downfall into addiction. Meanwhile, he and Joan once again find themselves in the crosshairs of the enigmatic Moriarty.","id":64306,"episode_number":23,"season_number":1,"still_path":"/xrIzpErFfWv3uTyZaeZuMeJRMTh.jpg","vote_average":10.0},{"name":"Heroine","overview":"As Sherlock reels at the reappearance of his former lover, Irene Adler, a series of flashbacks unravel the tumultuous events that led to his downfall into addiction. Meanwhile, he and Joan once again find themselves in the crosshairs of the enigmatic Moriarty.","id":64305,"episode_number":24,"season_number":1,"still_path":"/rjkeiWVkgxCqIaMzfdQVb3K0K0W.jpg","vote_average":10.0}],"name":"Season 1","overview":"","id":3712,"poster_path":"/44FcYhsLNjJA6d2ce5rYfaIVAJU.jpg","season_number":1}