{"episodes":[{"name":"The Long Bright Dark","overview":"Former Louisiana State CID partners Martin Hart and Rustin Cohle give separate statements to a pair of investigators about the murder of a prostitute, Dora Lange, 17 years earlier. As they look back, details of the crime, replete with occult overtones, are accompanied by insights into the detectives’ volatile partnership and personal lives.","id":970770,"episode_number":1,"season_number":1,"still_path":"/lnludtHZ9CUbXvyFk1ZnoOsXp6o.jpg","vote_average":8.125},{"name":"Seeing Things","overview":"Under pressure to land a suspect in the Lange murder, Quesada warns Hart and Cohle that they might be replaced by three detectives from a new task force. The pair lobbies for extra time to follow up on a lead that takes them from a rural cathouse to an incinerated church. With his marriage to Maggie already strained by work, Hart finds respite away from home.","id":970771,"episode_number":2,"season_number":1,"still_path":"/qp27i964h6JGyMAAhV5AFhGjyGW.jpg","vote_average":10.0},{"name":"The Locked Room","overview":"A hidden image at the burned-out church leads Cohle and Hart to Joel Theriot, a tent-revival minister whose parishioners finger a scarred “tall man” seen with Dora Lange. Brought in for interrogation, a sex offender matching the description is quickly dismissed by Cohle, despite offering a confession. Hart gets sidetracked after Maggie sets Cohle up with a friend at a C\u0026W bar. Looking to establish a pattern of murder, Cohle pores over old case files, finding a connection with a woman assumed to have drowned years earlier.","id":971104,"episode_number":3,"season_number":1,"still_path":"/9Icv5WubrQ0Cs7nEUxQ4WtD86Zm.jpg","vote_average":10.0},{"name":"Who Goes Here?","overview":"Hart and Cohle follow a series of leads in an effort to track down their prime suspect.","id":971604,"episode_number":4,"season_number":1,"still_path":"/ojMdG3FhruXBsqJNs3trR31GIgc.jpg","vote_average":9.666667},{"name":"The Secret Fate of All Life","overview":"A violent denouement in the forest clears the Dora Lange case and turns Cohle and Hart into local heroes. Each man settles into a healthier rhythm of living as Hart returns to his family, and Cohle starts a relationship while gaining a reputation as a closer in interrogations. As time passes and his daughters grow older, Hart faces new tensions and temptations, and Cohle learns from a double-murder suspect that there could be much more to an old case than he\u0027d once thought. In 2012, Gilbough and Papania put their cards on the table, presenting new intelligence that threatens Cohle and causes Hart to reassess everything he thought he knew about his former partner.","id":971895,"episode_number":5,"season_number":1,"still_path":"/6YtH2KI1tSFkdOBdEBZPEGOylJF.jpg","vote_average":9.5},{"name":"Haunted Houses","overview":"Maggie reveals Cohle\u0027s activities in 2002, when his relationship with Hart fractured and he quit the force.","id":971896,"episode_number":6,"season_number":1,"still_path":"/d37mf5zqg4qmjhW12YfJ2bKkJPs.jpg","vote_average":9.5},{"name":"After You\u0027ve Gone","overview":"Hart and Cohle call a truce to investigate a series of disappearances that may be related to the Dora Lange murder and the Tuttle family.","id":972935,"episode_number":7,"season_number":1,"still_path":"/zO2XgM2UtISHRz0mxr5zYRkk5yQ.jpg","vote_average":9.5},{"name":"Form and Void","overview":"An overlooked detail provides Hart and Cohle with an important new lead in their 17-year-old case.","id":972936,"episode_number":8,"season_number":1,"still_path":"/yd1R7LXFjoBMFgIvy1v6Nq174tv.jpg","vote_average":10.0}],"name":"Season 1","overview":"The lives of two detectives, Rust Cohle and Martin Hart, become entangled during a 17-year hunt for a serial killer in Louisiana.\n\n","id":59780,"poster_path":"/4axYYJK9QSwFLnTFK9j5Ybbfsnn.jpg","season_number":1}