{"episodes":[{"name":"Pilot","overview":"A \"closer\" for one of New York City\u0027s most successful law firms decides to hire an aloof genius who has passed the bar but never went to law school as his associate.","id":850681,"episode_number":1,"season_number":1,"still_path":"/aSZaWzIrhqrPemBvr2lLO83aS1B.jpg","vote_average":5.0},{"name":"Errors and Omissions","overview":"Mike has an ethical dilemma when Louis forces him to make a decision that could hurt his relationship with Harvey. Elsewhere, Harvey\u0027s past comes back to haunt him during a case.","id":850682,"episode_number":2,"season_number":1,"still_path":"/qDQf1jKp7ao65RB7naz2iDFkNsD.jpg","vote_average":5.0},{"name":"Inside Track","overview":"Jessica hopes Harvey\u0027s promotion will reign him in, but when a crisis arises with the first client he brought into the firm, Harvey goes rogue trying to fix it.","id":850683,"episode_number":3,"season_number":1,"still_path":"/zq4Cxp7iTiczO3zuCZFobmPfAJY.jpg","vote_average":5.0},{"name":"Dirty Little Secrets","overview":"Harvey and Jessica\u0027s relationship is tested when Harvey defends someone from her past. Also, Louis assigns Mike his first solo case, a pro bono that has him itching for a win.","id":850685,"episode_number":4,"season_number":1,"still_path":"/7HbhZF9fpSCH30h8oVLS4YtZuot.jpg","vote_average":5.0},{"name":"Bail Out","overview":"Mike\u0027s life becomes complicated when an old friend reappears and needs his help. Harvey must decide between closing a multi-million dollar deal and helping his trusted driver defend himself against a law suit.","id":850684,"episode_number":5,"season_number":1,"still_path":"/1yzskZeGaKB9VL5M9V8XHfuV2XF.jpg","vote_average":5.0},{"name":"Tricks of the Trade","overview":"Harvey and Mike work to save a woman wrongly accused of insider trading. Mike helps Rachel study for the LSAT, only to find out she is on the brink of discovering his closely guarded secret.","id":850686,"episode_number":6,"season_number":1,"still_path":"/mSPZBrkBleNHQmIPAQWkI6SE7qg.jpg","vote_average":5.0},{"name":"Play the Man","overview":"Mike takes on Louis\u0027 protégé during a mock trial, but his conflict with Rachel could hurt his chances of winning. Elsewhere, Harvey works on a merger between two hotel chains, but his past with the opposing counsel complicates matters.","id":850687,"episode_number":7,"season_number":1,"still_path":"/hZo1VC0ELwUciuiQflmS8ORofFc.jpg","vote_average":5.0},{"name":"Identity Crisis","overview":"Mike is tasked with reigning in a modern day Robin Hood whose illicit deeds are putting a client\u0027s business at risk. Also, Louis must resolve his differences with Harvey to win a case. Amanda Crew and Bruce Altman guest star.","id":850688,"episode_number":8,"season_number":1,"still_path":"/iIPxhR8L39zIYAzRLkhHfztc9SQ.jpg","vote_average":5.0},{"name":"Undefeated","overview":"Harvey meets his match in a cocky opposing counsel in a class action lawsuit, and Mike unknowingly helps frame Rachel as a traitor to the firm.","id":850689,"episode_number":9,"season_number":1,"still_path":"/fWyKzwGw4W3KvQxpWGlGoOJG9vD.jpg","vote_average":5.0},{"name":"Shelf Life","overview":"Harvey must fire an accountant for falsifying his credentials, but Mike finds a more sinister motive for his termination and becomes concerned about his own employment. Meanwhile, Louis thinks he\u0027s found his future wife.","id":850691,"episode_number":10,"season_number":1,"still_path":"/9nYeLvVboky0pHr95HP6UiGtsGX.jpg","vote_average":5.0},{"name":"Rules of the Game","overview":"Harvey\u0027s former mentor turns to him for help when his office comes under investigation. Meanwhile, Jenny suspects Mike may be occupied with more than just his job.","id":850690,"episode_number":11,"season_number":1,"still_path":"/kvuK5by4FoXSY2CbgedZKIEVIHJ.jpg","vote_average":5.0},{"name":"Dog Fight","overview":"Harvey\u0027s efforts to free an innocent man hit a wall when he goes against the new district attorney, who seems more focused on the integrity of the system than justice.","id":850692,"episode_number":12,"season_number":1,"still_path":"/y6PBJXNtO1dvwIvF0GzF7vYKVVC.jpg","vote_average":5.0}],"name":"Season 1","overview":"The first season of American Legal drama series Suits created by Aaron Korsh that stars Patrick J. Adams as Michael \"Mike\" Ross and Gabriel Macht as Harvey Spector. The first season debuted on 23 June, 2011. The season consists of 12 episodes, with a 90-minute long premiere which was viewed 4.64 million. The season finale was viewed by 3.47 million. The story follows Mike Ross, a brilliant college dropout who is hired by Harvey Spector, New York City\u0027s top corporate lawyer as his associate attorney.","id":49020,"poster_path":"/26rSctkzTmSqCDA7pTgLBXrv5Jj.jpg","season_number":1}