{"episodes":[{"name":"A Study in Pink","overview":"A war hero, invalided home from Afghanistan, meets a strange but charismatic genius who is looking for a flatmate; it is London, 2010, and Dr Watson and Sherlock Holmes are meeting for the first time. A string of impossible suicides has Scotland Yard baffled - and only one man can help.","id":578715,"episode_number":1,"season_number":1,"still_path":"/u8xvgVzTQjAeRu68sI9JJHeQSuA.jpg","vote_average":7.875},{"name":"The Blind Banker","overview":"A mysterious cipher is being scrawled on the walls around London. The first person to see the cipher is dead within hours of reading it. Sherlock plunges into a world of codes and symbols, consulting with London\u0027s best graffiti artists. He soon learns that the city is in the grip a gang of international smugglers, a secret society called the Black Lotus.","id":578717,"episode_number":2,"season_number":1,"still_path":"/v0Yl7lFkwOiPl5wpx61TXf6I2cu.jpg","vote_average":6.4166665},{"name":"The Great Game","overview":"A strange clue in an empty room, a blood-soaked car, a priceless Old Master, a deranged bomber. With the clock ticking, the curtain rises on a battle of wits between Sherlock, John and the shadowy stranger who seems to know all the answers...","id":578716,"episode_number":3,"season_number":1,"still_path":"/lBGlqpniRpwci6WX82ZJreBXZeM.jpg","vote_average":7.5833335}],"name":"Series 1","overview":"John Watson, army doctor, invalided home from Afghanistan, alone and friendless. Sherlock Holmes, the most brilliant intellect of his generation, alone and friendless. London 2010 – the best and longest friendship in all of fiction is about to begin anew. The most famous detective, the most baffling mysteries, the most thrilling adventures and the deadliest foes, are coming in out of the fog. Sherlock Holmes was always a modern man – it was the world that got old. Now he’s back as he should be – edgy, contemporary, difficult, dangerous. Inspector Lestrade is the best Scotland Yard has got, but he knows he’s not as good as a strange young man called Sherlock.","id":30121,"poster_path":"/57o4MgHdSXP9SANGcDevuHqpT3G.jpg","season_number":1}