{"results":[{"id":0,"vote_average":0.0},{"poster_path":"/fvocBFChMERoxWb7MMuTsUqWEis.jpg","backdrop_path":"/rvk7SMZRKR5BxDAxZmR5RF666uC.jpg","id":41727,"vote_average":7.4,"overview":"Banshee is an American drama television series set in a small town in Pennsylvania Amish country and features an enigmatic ex-con posing as a murdered sheriff who imposes his own brand of justice while also cooking up plans that serve his own interests.","name":"Banshee"},{"poster_path":"/1yeVJox3rjo2jBKrrihIMj7uoS9.jpg","backdrop_path":"/eSzpy96DwBujGFj0xMbXBcGcfxX.jpg","id":1396,"vote_average":8.42,"overview":"Breaking Bad is an American crime drama television series created and produced by Vince Gilligan. Set and produced in Albuquerque, New Mexico, Breaking Bad is the story of Walter White, a struggling high school chemistry teacher who is diagnosed with inoperable lung cancer at the beginning of the series. He turns to a life of crime, producing and selling methamphetamine, in order to secure his family\u0027s financial future before he dies, teaming with his former student, Jesse Pinkman. Heavily serialized, the series is known for positioning its characters in seemingly inextricable corners and has been labeled a contemporary western by its creator.","name":"Breaking Bad"},{"poster_path":"/jIhL6mlT7AblhbHJgEoiBIOUVl1.jpg","backdrop_path":"/mUkuc2wyV9dHLG0D0Loaw5pO2s8.jpg","id":1399,"vote_average":8.3,"overview":"Seven noble families fight for control of the mythical land of Westeros. Friction between the houses leads to full-scale war. All while a very ancient evil awakens in the farthest north. Amidst the war, a neglected military order of misfits, the Night\u0027s Watch, is all that stands between the realms of men and icy horrors beyond.","name":"Game of Thrones"},{"poster_path":"/ieXc6ryp53DGOv9X3PFhTvTtLau.jpg","backdrop_path":"/6X9pyhrKSy0zEpqpBBlaLZdULLv.jpg","id":62687,"vote_average":6.19,"overview":"Limitless, based on the feature film, picks up where the movie left off and follows Brian Sinclair as he discovers the power of the mysterious drug NZT, and is coerced into using his newfound drug-enhanced abilities to solve weekly cases for the FBI.","name":"Limitless"}]}