{"episodes":[{"name":"Pilot","overview":"A recently paroled master thief assumes the identity of Lucas Hood, sheriff-in-waiting of Banshee, Pa. Keeping his history a secret, Lucas befriends boxer-turned-bartender Sugar Bates, and settles into his new life as Banshee’s sheriff. Lucas inadvertently gets tangled up in the rampant corruption of shunned Amish gangster Kai Proctor, while keeping a vigilant eye out for Mr. Rabbit, the New York mob boss who wants revenge against Lucas and former partner and lover Carrie for the jewel heist that landed Lucas in prison.","id":876830,"episode_number":1,"season_number":1,"still_path":"/9sOf2ixNYieOzQaYdffS3srWF06.jpg","vote_average":0.0},{"name":"The Rave","overview":"Proctor’s desperate underling Hanson decides to hold a rave in an Amish barn, selling homemade E pills stolen from Proctor to Banshee youth including Deva, Carrie’s rebellious daughter. Catching wind of the plan, Lucas and his team orchestrate a raid, but the effects of a tainted batch of pills send many revelers into convulsions, with one notable fatality.","id":876831,"episode_number":2,"season_number":1,"still_path":"/sQkFsIjTf7lH1Fo7UQu11YdkVzK.jpg","vote_average":0.0},{"name":"Meet the New Boss","overview":"A mixed martial arts title bout is being planned at the local Kinaho Moon Casino, run by tribe leader Benjamin Longshadow and his son Alex. Huge profits are anticipated for Banshee investors, but the enterprise is threatened when the champion angers Lucas.","id":876832,"episode_number":3,"season_number":1,"still_path":"/9wm3bbiijAyWbzx5A3L0dwnpXWn.jpg","vote_average":0.0},{"name":"Half Deaf is Better Than All Dead","overview":"A botched museum heist in Harrisburg has unintended consequences, as Lucas, Carrie and Job renew their partnership, at least for the moment. Later, after coercing redneck henchman Arno to offer up incriminating evidence, Lucas and Emmett arrest Proctor for Hanson’s murder, but are detoured on the way to the jail. Sugar looks for a cut; Kendall gets roughed up; Lucas and Carrie love the ones they’re with.","id":876833,"episode_number":4,"season_number":1,"still_path":"/dle1AUsGumD5huWGuwumyMVpmJD.jpg","vote_average":0.0},{"name":"The Kindred","overview":"A band of marauding bikers crashes the annual Banshee Spirit Festival, with deadly consequences, sparking Lucas and Siobhan to meter out vigilante justice. Burned after losing his key witness against Proctor, Lucas is further dismayed when FBI agent Xavier arrives to monitor the situation. Rebecca Bowman, torn between passion and her Amish roots, finds a kindred spirit in the sheriff.","id":876834,"episode_number":5,"season_number":1,"still_path":"/AsHdFUi1AzfBcc4zbwxW0gOzmpB.jpg","vote_average":0.0},{"name":"Wicks","overview":"Wicks, an ex-con from Lucas’ past, passes through Banshee, triggering memories about the Albino, a brutal insider enlisted by Rabbit to make Lucas’ prison life a living hell. Proctor turns to extortion when a reverend refuses to sell his home to make room for a casino hotel.","id":876835,"episode_number":6,"season_number":1,"still_path":"/hjJ0P8wSHCNZWKub6RxJayRBJTX.jpg","vote_average":0.0},{"name":"Behold a Pale Rider","overview":"Lucas’ cover is threatened when Carrie decides to give him over to Rabbit in an effort to protect herself and her family. Meanwhile, a drugstore robbery turns into a full-blown hostage crisis at the high school, with Deva and Mayor Kendall’s wife Janie among those whose lives are imperiled.","id":876836,"episode_number":7,"season_number":1,"still_path":"/1E4n7va1Dmv6Xbtgog8M01PYlmZ.jpg","vote_average":0.0},{"name":"We Shall Live Forever","overview":"Carrie urges Lucas to let go of the past, even as an increasingly suspicious Gordon is hell-bent on uncovering hers. Cast out of her Amish home, Rebecca turns to Proctor to give her a new start in Banshee. A surprise visit from Rabbit’s lieutenant, Olek, a.k.a. Widow’s Peak, brings back a flood of memories for Carrie. As his family keeps vigil for the ailing Benjamin Longshadow, Alex gets a surprise visit from his sister Nola.","id":876837,"episode_number":8,"season_number":1,"still_path":"/dg6gZKbwPQW539NIMss6p0ORmo3.jpg","vote_average":0.0},{"name":"Always the Cowboy","overview":"As Rabbit closes in on Carrie and Lucas, Carrie flees the hospital in a desperate attempt to collect her family and get them out of town. Kai introduces Rebecca to the business world, and sends Lucas a message about fooling around with his niece. Alex Longshadow recruits a Proctor thug with gambling issues to deal with a work-stoppage problem at the casino.","id":876838,"episode_number":9,"season_number":1,"still_path":"/8bT98ELELVOQY2Vl7VUU16Zt0HB.jpg","vote_average":0.0},{"name":"A Mixture of Madness","overview":"Recalling a series of prison therapy sessions that fueled his hatred of Rabbit, and pressed by Xavier’s insistence that the FBI handle a kidnapping case, Lucas makes a decision that will change the collective fate of Carrie, her family, Sugar, Job, and the entire Banshee police force. A special delivery at Alex’s doorstep leads Nola to reconsider her future; Kai teaches Rebecca the power of telecommunications.","id":876839,"episode_number":10,"season_number":1,"still_path":"/dFqFdU4RnV62VMFEcbEKxB1VPdN.jpg","vote_average":6.0}],"name":"Season 1","overview":"","id":51878,"poster_path":"/zMuJV3k4rYm7keUTu8nhOJOgCSn.jpg","season_number":1}