{"episodes":[{"name":"Pilot, Part 1","overview":"Time Master Rip Hunter puts together his diverse team to fight immortal villain Vandal Savage who is on the verge of destroying humanity in 2166.","id":1140080,"episode_number":1,"season_number":1,"still_path":"/9Ktx5gUKWzIfBShGfrPwFkLdxLT.jpg","vote_average":8.0},{"name":"Pilot, Part 2","overview":"The team battles Vandal Savage, and Atom\u0027s suit falls off and lands in the wrong hands. Stein realizes the best way to retrieve it is by contacting his younger self. Snart and Rory plan to steal a key element in defeating Savage. Carter helps Kendra remember something vital.","id":1143364,"episode_number":2,"season_number":1,"still_path":"/aX6YKEJb20Fz7Xu8aZAhHHqVYIH.jpg","vote_average":7.5},{"name":"Blood Ties","overview":"Rip decides to weaken Vandal Savage by going after his financial assets. Rip and Sara infiltrate Savage’s bank, but are discovered by his men. Snart and Rory talk Jax into taking the jump ship back to Central City so they can steal a valuable emerald.","id":1143365,"episode_number":3,"season_number":1,"still_path":"/u744gRnC4GFmByADzuUXYL8NEuo.jpg","vote_average":6.0},{"name":"White Knights","overview":"Nuclear scientists mysteriously disappear when Vandal Savage retreats behind the Iron Curtain in the early 1980s. The team follows Vandal\u0027s trail in an effort to find his next target, while Ray bonds with a beautiful Soviet scientist. Stein pushes Jax to be better, which frustrates Jax and ultimately threatens the Firestorm matrix. Rip asks Sara to train Kendra.","id":1143366,"episode_number":4,"season_number":1,"still_path":"/rug5iCzt8DdRG6Iq8gTdlEvsPjn.jpg","vote_average":6.25},{"name":"Fail-Safe","overview":"After some of the Legends are captured and thrown into a Russian gulag during the height of the Cold War of 1986, Snart leads the team in an elaborate escape plan to free their comrades. However, Rip gives Sara a secret side mission that could prove not only to be a liability, but fatal to the team.","id":1143367,"episode_number":5,"season_number":1,"still_path":"/1WjHwKso34kYjKrkbbj07wsfY8P.jpg","vote_average":8.0},{"name":"Star City 2046","overview":"When a malfunction sends the Waverider crashing into 2046 Star City, our heroes face a startling version of their own future where they never stop Savage and never return home. The city is in ruins and overrun by criminals, which thrills Rory. Sara is despondent over the destruction of her home and stunned when she learns what happened to her old friend, Oliver Queen.","id":1143368,"episode_number":6,"season_number":1,"still_path":"/ah8uZMtr8ujiDWdFA8ibqmvR8IG.jpg","vote_average":8.0},{"name":"Marooned","overview":"After receiving a distress call from another timeship stranded in space, Rip decides to answer the call in order to use the other ship’s computer to track Savage. The team is suspicious and warns him this could be a trap but he moves forward with his plan. Ultimately, the team was right and they have to battle time pirates. With most of the team captured, it is up to Professor Stein to rescue them all.","id":1143369,"episode_number":7,"season_number":1,"still_path":"/bMAWK4t2ClLA56I6Et9rGqu3oPa.jpg","vote_average":9.0},{"name":"Night of The Hawk","overview":"The team tracks Savage to a small town in Oregon during the 1950s. Upon  arrival, they discover there have been a recent string of murders and  they suspect Savage is involved. Professor Stein and Sara go undercover  at a psychiatric hospital, where Savage is working as a doctor, to find  out his plan. While there, Sara meets a nurse named Lindsay and sparks  fly. Meanwhile, Ray and Kendra pretend to be a married couple to gain  the neighborhood’s trust, but an interracial couple in the ‘50s isn’t  something that goes unnoticed. Soon, Savage is at their door.","id":1149521,"episode_number":8,"season_number":1,"still_path":"/5NqZhXH2FlxUTbtycBCkChiIJ1.jpg","vote_average":8.0},{"name":"Left Behind","overview":"Ray, Sara and Kendra are shocked after they watch the Waverider fly off without them, leaving them stranded in the ‘50s. After waiting months for their teammates to come back, the three realize they must move on with their lives. Ray and Kendra bond as a couple but Sara decides to return to the League of Assassins and Ra’s al Ghul.","id":1149522,"episode_number":9,"season_number":1,"still_path":"/vSHuAAYWv8XYKoXA6Z2ecTJfkol.jpg","vote_average":8.0},{"name":"Progeny","overview":"Rip tells the team they are headed to the future to take out a powerful ally that Savage needs in order to conquer the world. However, when Rip reveals the ally is a 14 year-old boy who will one day grow into an evil dictator, the team is split about the morality of killing a child, even if it does save the world. Meanwhile, Sara talks Snart through a rough patch and Ray learns something that could impact his future with Kendra.","id":1159991,"episode_number":10,"season_number":1,"still_path":"/g11UcWWj7ckjIUzVKtNjcak8lyv.jpg","vote_average":10.0},{"name":"The Magnificent Eight","overview":"The Legends travel back to the Old Wild West and gain the aid of a true legend, a morally ambiguous gunslinger with a penchant for danger, Jonah Hex, who has been battling outlaws and gangs and happens to know a thing or two about time travel. Hex warns the Legends to be extra careful in their journey to the small town of Salvation.","id":1160671,"episode_number":11,"season_number":1,"still_path":"/jAgZI4sNmel4cBaqlehDJ1JPyIZ.jpg","vote_average":8.0},{"name":"Last Refuge","overview":"The team is targeted by The Pilgrim, a deadly assassin who wants to  erase the Legends from the timeline by killing their younger,  non-superhero selves. As a protective countermeasure, Rip decides Sara,  Snart, Rory, Professor Stein and Jax need to kidnap their past selves  first before The Pilgrim gets to them. Coming face-to-face with the  younger versions of themselves proves to be both a physical and  emotional challenge for certain members of the team who would rather  forget their past. Rip tells them he has a refuge for their precious  cargo – an orphanage that raises future Time Masters and where he  himself grew up.","id":1167805,"episode_number":12,"season_number":1,"still_path":"/dOG0lrtNcYUaroHYupFBTCXtnXL.jpg","vote_average":10.0},{"name":"Leviathan","overview":"Rip takes the team to London in the year 2166, three months before his  family is killed. He believes this to be their final opportunity to take  out Savage who is, unfortunately, at the height of his power. However,  the team discovers two key elements to defeating him – Savage’s daughter  and the means to kill Savage once and for all.","id":1167806,"episode_number":13,"season_number":1,"still_path":"/o7jgdbZuhYBY5mmT6VYlGYhyxjL.jpg","vote_average":0.0},{"name":"River of Time","overview":"After numerous attempts in many different time periods, the team has  successfully captured Vandal Savage. However, Savage tells Kendra that  he can reunite her with Carter so she struggles with whether she should  kill him. Rip decides they will deliver Savage to the Time Masters which  doesn’t sit well with Snart and Rory. The duo decides it may be time to  jump ship and return to their old life. Meanwhile, Savage taunts Ray  about his place in Kendra’s life.","id":1173580,"episode_number":14,"season_number":1,"vote_average":0.0},{"name":"Destiny","overview":"","id":1179350,"episode_number":15,"season_number":1,"vote_average":0.0},{"name":"Legendary","overview":"","id":1179351,"episode_number":16,"season_number":1,"vote_average":0.0}],"name":"Season 1","overview":"","id":66615,"poster_path":"/jw0txL021CLRFMlCzC0XcONw9fQ.jpg","season_number":1}