{"episodes":[{"name":"Pilot","overview":"Brian Finch\u0027s life takes an extraordinary turn when he uses a mysterious drug, NZT, that allows him to access his full brain capacity. However, when an NZT-related murder lands Brian on the FBI\u0027s radar, he uses the drug in an attempt to stay ahead of the authorities long enough to clear his name.","id":1091579,"episode_number":1,"season_number":1,"still_path":"/bg2QIwX0nwIdrFihSeuxKEeIU0v.jpg","vote_average":6.1666665},{"name":"Badge! Gun!","overview":"Brian risks his new FBI job when he disobeys orders to stay out of the investigation into a renowned journalist’s murder.","id":1108296,"episode_number":2,"season_number":1,"still_path":"/A7YABi9cVHdWUfhpy3faFq4jM1K.jpg","vote_average":9.0},{"name":"The Legend of Marcos Ramos","overview":"When Brian helps Agents Harris and Boyle investigate the murder of a retired FBI agent, they’re shocked to find a link to the elusive head of a notorious drug cartel. Also, Brian reconnects with an old flame, Shauna but worries her renewed interest is really in the NZT version of him.","id":1109584,"episode_number":3,"season_number":1,"still_path":"/qOQSD9ii451Kwjm8zZg1AxWnFf0.jpg","vote_average":0.0},{"name":"Page 44","overview":"Brian\u0027s loyalty to the FBI is tested when Sands, Senator Edward Morra\u0027s representative, demands he steals the FBI\u0027s secret files on NZT. Also, Agent Harris is emotionally conflicted when she learns what her estranged father left her following his death.","id":1109695,"episode_number":4,"season_number":1,"still_path":"/oNK1JPYFyBGPGDoz6HSs968WCAn.jpg","vote_average":0.0},{"name":"Personality Crisis","overview":"Brian learns a shocking secret about Rebecca\u0027s late father but worries that telling her will land him in legal trouble. Also, Brian accidentally meddles in Rebecca\u0027s personal life while learning self-defense from her secret boyfriend, FBI Agent Casey Rooks.","id":1109696,"episode_number":5,"season_number":1,"still_path":"/plFcsHnp3u24rTwHMTr0JD3ng1M.jpg","vote_average":0.0},{"name":"Side Effects May Include...","overview":"When Brian begins to experience the side effects of NZT again, Senator Morra demands he betrays Rebecca in exchange for another inoculation. Also, Brian secretly looks for an alternate cure for himself while he works with Rebecca outside FBI parameters to find the creators of NZT.","id":1115818,"episode_number":6,"season_number":1,"still_path":"/uJNxsOpxxZjIjPvcejNvkYv4P7b.jpg","vote_average":0.0},{"name":"Brian Finch\u0027s Black Op","overview":"When Brian calls in sick for a day off from the FBI, the CIA abducts him from home to borrow his NZT-enhanced capabilities for a black ops mission. As the operation becomes increasingly dangerous, Brian finds himself without FBI support in a situation that\u0027s spiraling out of control.","id":1115819,"episode_number":7,"season_number":1,"still_path":"/oYDclkPyhBpQXrsdWR8ZWv1FII5.jpg","vote_average":0.0},{"name":"When Pirates Pirate Pirates","overview":"When Naz is detained on suspicion of funding terrorism, Brian and Rebecca\u0027s efforts to clear her name lead them to Naz\u0027s daughter, Ava, who reveals a family secret Naz is keeping from the FBI.","id":1132810,"episode_number":8,"season_number":1,"still_path":"/3sh2SIpyui2HVDkf3h8BI49m8a6.jpg","vote_average":0.0},{"name":"Headquarters!","overview":"Brian offers to use NZT to capture the FBI\u0027s \"Ten Most Wanted\" criminals in two weeks, in exchange for Naz giving him his own personal work \"headquarters\" at the agency. Also, the secretive nature of Brian\u0027s new life working for the Bureau creates a rift between him and his father.","id":1132811,"episode_number":9,"season_number":1,"still_path":"/wNJ9V6DtmgC8rroR3aMhSTttSpu.jpg","vote_average":5.0},{"name":"Arm-ageddon","overview":"When Boyle\u0027s former military buddy is accused of murder and blames it on the loss of control of his prosthetic arm, Boyle asks Brian to help determine if the artificial limb was hacked. Also, Brian\u0027s father demands he stop working for the FBI.","id":1134781,"episode_number":10,"season_number":1,"still_path":"/iDyOkZId4UWjpo5NOJfkMjJCp7U.jpg","vote_average":0.0},{"name":"This Is Your Brian on Drugs","overview":"When Agent Casey Rooks and his SWAT team skim 80 NZT pills for themselves from the recovery of stolen inventory, it starts an internal investigation that is viewed through the shifting perspectives of Brian’s immediate circle at the FBI.","id":1147324,"episode_number":11,"season_number":1,"still_path":"/w4D5oH6wX6y9Zls1qgKmgFZBRGd.jpg","vote_average":7.0},{"name":"The Assassination of Eddie Morra","overview":"When an assassin makes an attempt on Senator Edward Morra\u0027s life, Brian is ordered to sabotage the FBI\u0027s investigation into it in order to prevent exposing the Senator\u0027s connection to NZT. As Brian and Morra\u0027s fates become further intertwined, Brian is faced with how far he\u0027s willing to go to protect the politician.","id":1148394,"episode_number":12,"season_number":1,"still_path":"/wSr3qqpcyezIDKuOZaBlXU4BtdF.jpg","vote_average":6.0},{"name":"Stop Me Before I Hug Again","overview":"Brian embarks on his first FBI field assignment when he travels to Quantico to lend his skills to the bureau unit that catches serial killers. However, the trip takes a negative turn when Brian realizes the man he\u0027s working with may have put away an innocent person in the career-making case that made him a renowned profiler. Also, Brian tries to stay one step ahead of Rebecca as she comes closer to discovering Senator Morra\u0027s connection to NZT.","id":1150178,"episode_number":13,"season_number":1,"still_path":"/s0m7UtCXkzg94nr8M2LZQNJZpE9.jpg","vote_average":3.25},{"name":"Fundamentals of Naked Portraiture","overview":"When a developer at the tech think tank Brian frequents is murdered, he and Rebecca interview the robotic version of the victim that she created before her death for clues to the killer\u0027s identity. Also, Brian screens agents for a position to join Mike and Ike as his third bodyguard.","id":1159487,"episode_number":14,"season_number":1,"still_path":"/5bdx7t43s1IdxJvuCpIDeOzx5Lx.jpg","vote_average":0.0},{"name":"Undercover!","overview":"After a list with the real identities of undercover bureau operatives leaks, Brian develops a personal connection with FBI Agent Lucy Church, a tenacious rule-breaker, when he helps her finish a field case before she\u0027s exposed. Also, Sands makes a surprising move to end Rebecca\u0027s investigation into Senator Morra.","id":1161188,"episode_number":15,"season_number":1,"still_path":"/90JHQpKoZPhJn4VtcKqF6VFjjn8.jpg","vote_average":7.0},{"name":"Sands, Agent of Morra","overview":"When Sands, Senator Morra’s deadly representative, enlists Brian’s help to eliminate an immediate threat he needs to keep secret from the politician, Brian learns Sands’ dangerous and shocking past. Also, Brian’s sister, Rachel, scrambles to cover up his abrupt side mission with Sands when the FBI can’t reach him regarding a new case.","id":1166387,"episode_number":16,"season_number":1,"still_path":"/eTzmLiFC0zP9Hv65mcX3S0kC4LT.jpg","vote_average":8.0},{"name":"Close Encounters","overview":"Brian and Rebecca are placed under quarantine by the CDC after being exposed to an unknown substance after investigating a citywide blackout. Also, trust issues arise after Rebecca catches Brian using his secret stash of NZT.","id":1166388,"episode_number":17,"season_number":1,"still_path":"/9YmJ3d1Tx3VZM4OIYAcrDt2Zlv5.jpg","vote_average":8.0},{"name":"Bezgranichnyy","overview":"With his closest relationships imploding, Brian goes rogue from the FBI and heads to Russia to find the only person who can help him cut ties once and for all with Senator Eddie Morra. As he tracks down a former Morra associate-turned-adversary who possesses an alternative NZT vaccine, Rebecca comes closer to discovering Brian\u0027s secret.","id":1167130,"episode_number":18,"season_number":1,"still_path":"/wnKLGRd3GDRy0yiMwoQk2MmDUHf.jpg","vote_average":8.0},{"name":"A Dog\u0027s Breakfast","overview":"Brian’s double life unravels when Senator Morra makes contact just as Brian’s placed under 24-hour surveillance by the FBI following his rogue trip to Russia. Also, Mike and Ike tell an already suspicious Rebecca about Brian’s off-book interaction with Morra’s henchman, Sands.","id":1175667,"episode_number":19,"season_number":1,"still_path":"/2T0zlTjD5Gx6fzSsYwNryZOwVjo.jpg","vote_average":6.0},{"name":"Hi, My Name Is Rebecca Harris","overview":"When Rebecca learns the truth about her father\u0027s death, she takes NZT for the first time and uses it to seek justice for his murder. Also, Sands makes a dangerous move against Brian to ensure the success of his new initiative.","id":1175668,"episode_number":20,"season_number":1,"still_path":"/99mPgpfEDhRCyvAcuaDpHBTz6st.jpg","vote_average":8.0},{"name":"Finale: Part One!","overview":"When NZT floods the streets of New York City and threatens to become a national epidemic, the FBI partners with the DOJ in a city-wide manhunt to find the lab producing the drug. Also, Brian has trouble adjusting to his new reality when he lacks the resources to continue searching for Piper","id":1183438,"episode_number":21,"season_number":1,"still_path":"/dx3LqJYxfHy18CmuG7FvSqX8axb.jpg","vote_average":8.0},{"name":"Finale: Part Two!!","overview":"Following a stunning betrayal to their team, Brian and the FBI race to stop an NZT-enabled Sands and his associates from orchestrating an international incident. Also, Brian experiences devastating side effects when his NZT immunity starts to wear off.","id":1183440,"episode_number":22,"season_number":1,"still_path":"/4jpKMXyF6XAVWkQ5Z5Whz7kFa3d.jpg","vote_average":0.0}],"name":"Season 1","overview":"","id":66733,"poster_path":"/hzDlFnxHh0rj7cxUwTNPYSsJfMT.jpg","season_number":1}