{"episodes":[{"name":"Days Gone Bye","overview":"Rick searches for his family after emerging from a coma into a world terrorized by the walking dead. Morgan and Duane, whom he meets along the way, help teach Rick the new rules for survival.","id":63339,"episode_number":1,"season_number":1,"still_path":"/qDNQ2pliJbWjS0SBBuz85Pa5ilH.jpg","vote_average":5.82},{"name":"Guts","overview":"Rick unknowingly causes a group of survivors to be trapped by walkers. The group dynamic devolves from accusations to violence, as Rick must confront an enemy far more dangerous than the undead.","id":63337,"episode_number":2,"season_number":1,"still_path":"/9wGCjzZMAd7wS4LrxJadQPUelnn.jpg","vote_average":5.0},{"name":"Tell It to the Frogs","overview":"After returning to the camp with the department store survivors and an emotional reunion with his wife and son, Rick decides to go against Shane\u0027s advice and go back to Atlanta for Merle Dixon and his dropped bag of guns accompanied by Merle\u0027s younger brother, Darryl Dixon, as well as Glenn and T-Dog.","id":63338,"episode_number":3,"season_number":1,"still_path":"/wf6khmBquD2QUNiYBKCRPncJiYD.jpg","vote_average":5.0},{"name":"Vatos","overview":"Rick, Glenn, T-Dog, and Daryl move on after their grisly discovery to retrieve the guns when they encounter a group of scavengers who narrowly beat them to the catch. However, Glenn is kidnapped in the scuffle, which leads to a tense stand-off and a surprising discovery. Meanwhile, back at camp, the group has to handle a serious situation when Jim begins acting unhinged.","id":63336,"episode_number":4,"season_number":1,"still_path":"/9Q7hxPecLQUWIaTYRmNU1HNLjsf.jpg","vote_average":5.0},{"name":"Wildfire","overview":"Everyone deals with the fallout of the walker attack. Andrea has to come to grips with the fate of her sister, while Jim is found out to have been bitten. With the camp clearly no longer safe, a decision must made about the direction they are to take.","id":63340,"episode_number":5,"season_number":1,"still_path":"/evwBjSw9PHnvarsnvqAvSuqxjTy.jpg","vote_average":5.0},{"name":"TS-19","overview":"Rick and the group are allowed into the CDC by a strange doctor, but all is not what it seems in their newfound haven.","id":63341,"episode_number":6,"season_number":1,"still_path":"/mNRriwCHDpS3faTffHh2c7YkruL.jpg","vote_average":5.0}],"name":"Season 1","overview":"The first season of AMC\u0027s television series The Walking Dead premiered on October 31, 2010 and concluded on December 5, 2010. The series is based on the series of graphic novels of the same name by Robert Kirkman, Tony Moore and Charlie Adlard. It was developed for television by Frank Darabont, who wrote or co-wrote four of the season\u0027s six episodes and directed the pilot.\n\nThe first season was met with positive reviews from critics and gained 5.35 million viewers on its premiere. The finale garnered six million viewers and among adults ages 18–49 it became the most viewed basic cable drama series of all time.","id":3643,"poster_path":"/yaOB2Y8GcoXwjNQ3apq67bMbNHF.jpg","season_number":1}