{"episodes":[{"name":"Pilot","overview":"When an unassuming high school chemistry teacher discovers he has a rare form of lung cancer, he decides to team up with a former student and create a top of the line crystal meth in a used RV, to provide for his family once he is gone.","id":62085,"episode_number":1,"season_number":1,"still_path":"/ydlY3iPfeOAvu8gVqrxPoMvzNCn.jpg","vote_average":7.6862745},{"name":"The Cat\u0027s in the Bag","overview":"Walt and Jesse attempt to tie up loose ends. The desperate situation gets more complicated with the flip of a coin. Walt\u0027s wife, Skyler, becomes suspicious of Walt\u0027s strange behavior.","id":62086,"episode_number":2,"season_number":1,"still_path":"/tjDNvbokPLtEnpFyFPyXMOd6Zr1.jpg","vote_average":7.5},{"name":"...and the Bag\u0027s in the River","overview":"Walter fights with Jesse over his drug use, causing him to leave Walter alone with their captive, Krazy-8. Meanwhile, Hank has a scared straight moment with Walter Jr. after his aunt discovers he has been smoking pot. Also, Skylar is upset when Walter stays away from home.","id":62087,"episode_number":3,"season_number":1,"still_path":"/2kBeBlxGqBOdWlKwzAxiwkfU5on.jpg","vote_average":6.5},{"name":"Cancer Man","overview":"Walter finally tells his family that he has been stricken with cancer. Meanwhile, the DEA believes Albuquerque has a new, big time player to worry about. Meanwhile, a worthy recipient is the target of a depressed Walter\u0027s anger, and Jesse makes a surprise visit to his parents home.","id":62088,"episode_number":4,"season_number":1,"still_path":"/i5BAJVhuIWfkoSqDID6FnQNCTVc.jpg","vote_average":6.5},{"name":"Gray Matter","overview":"Walter and Skyler attend a former colleague\u0027s party. Jesse tries to free himself from the drugs, while Skyler organizes an intervention.","id":62089,"episode_number":5,"season_number":1,"still_path":"/aR1BLarVxcMSemL6Q0C796nZfC2.jpg","vote_average":6.5},{"name":"Crazy Handful of Nothin\u0027","overview":"The side effects of chemo begin to plague Walt. Meanwhile, the DEA rounds up suspected dealers.","id":62090,"episode_number":6,"season_number":1,"still_path":"/fZST9WpwrYl2qHq3WHdUFDrPc2U.jpg","vote_average":7.0},{"name":"A No-Rough-Stuff Type Deal","overview":"Walter accepts his new identity as a drug dealer after a PTA meeting. Elsewhere, Jesse decides to put his aunt\u0027s house on the market and Skyler is the recipient of a baby shower.","id":62091,"episode_number":7,"season_number":1,"still_path":"/gyRMAdWZHhWpXpOvA1ctwoIuG4e.jpg","vote_average":5.75}],"name":"Season 1","overview":"The first season of the American television drama series Breaking Bad premiered on January 20, 2008 and concluded on March 9, 2008. It consisted of seven episodes, each running approximately 47 minutes in length, except the pilot episode which runs approximately 57 minutes. AMC broadcast the first season on Sundays at 10:00 pm in the United States. Season one was to consist of nine episodes, which was reduced to seven by the writer\u0027s strike. The complete first season was released on Region 1 DVD on February 24, 2009 and Region A Blu-ray on March 16, 2010.","id":3572,"poster_path":"/o5131POxv9xFl3wBmdg0YWc9Iz4.jpg","season_number":1}