{"episodes":[{"name":"Pilot","overview":"When all the passengers on a plane die, FBI agent Olivia Dunham investigates the events and her partner almost dies. A desperate Olivia looks for help from Dr. Walter Bishop who has been institutionalized. Olivia, Dr. Bishop and his son Peter begin to discover what really happened on Flight 627 and begin to uncover a larger truth.","id":87875,"episode_number":1,"season_number":1,"still_path":"/aPVxQJDzmL1TuW3DYUCHNVwHkgF.jpg","vote_average":0.0},{"name":"The Same Old Story","overview":"Olivia, along with Peter and Walter Bishop, investigates the strange death of a woman who had an even stranger child. The woman was pregnant for only hours, yet the baby she birthed was fully developed - and also aged eighty years in the span of a few minutes. Olivia asks Nina Sharp of Massive Dynamic for help.","id":87878,"episode_number":2,"season_number":1,"still_path":"/hBZjNWBElTh6v4tGRLtktjEs1R8.jpg","vote_average":0.0},{"name":"The Ghost Network","overview":"The team investigates a bus full of dead commuters that appear to be fossilized and uncover a man who has visions of pattern-related disturbances before they happen; Dr. Bishop requests a piano in the lab to help him process data.","id":87881,"episode_number":3,"season_number":1,"still_path":"/6wdELiqirrML0BfVDl8tc3cLxpw.jpg","vote_average":0.0},{"name":"The Arrival","overview":"Broyles calls in the team to investigate a deadly explosion and its source: a strange cylinder unharmed despite the destruction. Olivia determines that the same cylinder, or a similar one, is responsible for similar events in widely diverse locations.","id":87916,"episode_number":4,"season_number":1,"still_path":"/lhpvwfrG2LMbuFc06XWdVWYAuYx.jpg","vote_average":0.0},{"name":"Power Hungry","overview":"\"Power Hungry\" is the fifth episode of the first season of the American science fiction drama television series Fringe. The episode was written by playwright Julia Cho and consulting producer Jason Cahill, and was directed by Christopher Misiano. The episode focuses on Fringe Division\u0027s efforts in finding a man with the uncontrolled ability to affect electrical energy, thanks to the work of a wanted rogue scientist. Meanwhile, Olivia Dunham sees visions of her deceased lover, John Scott.\n\nThe episode\u0027s premise began with the idea of a computer virus being able to spread to humans, which then evolved into the story of a man who comes into his unique abilities. Series consultant Glen Whitman noted the premise was based on the \"very very weak magnetic field\" of electrical energy surrounding humans that an EEG detects, and the writers simply amplified this. The special effects crew undertook much preparation to simulate a chase sequence involving an exploding transformer, leading guest actor Ebon Moss-Bachrach to note how scary the effect was to film.\n\nIt first aired in the United States on October 14, 2008 on the Fox network, and was seen by an estimated 9.157 million American viewers, the network\u0027s second highest rated show for the week. Critical reactions of the episode ranged from mixed to positive, as many believed the series was finally finding its footing. Others however critiqued the episode for seeming too ordinary for a science fiction series.","id":88075,"episode_number":5,"season_number":1,"still_path":"/ir7XGaKBpyF9pmicbIrq0yhs0qL.jpg","vote_average":0.0},{"name":"The Cure","overview":"The team investigates a woman that re-appears after weeks of being missing with a rare disease.  She also inexplicably causes pain and death to the people she meets. During the investigation, dangerous level of radiation are detected. Walter obsesses about cotton candy; Peter strikes a deal with Nina Sharp; and a truth about Olivia is discovered.","id":87926,"episode_number":6,"season_number":1,"still_path":"/u6tzTR0Ls0LZemG2BViPnr6rF3r.jpg","vote_average":0.0},{"name":"In Which We Meet Mr. Jones","overview":"When a strange parasite attaches itself to the internal organs of a dying FBI agent, Olivia suspects a connection to the Pattern; Peter and Walter tap into a dead man\u0027s brain waves.","id":88382,"episode_number":7,"season_number":1,"still_path":"/pfLfZOSOGgXHp3RyUtYWdT4BWUT.jpg","vote_average":0.0},{"name":"The Equation","overview":"Walter thinks the abduction of a young music prodigy is linked back to his old bunkmate at St. Claire\u0027s Hospital. When he kidnaps the child he see\u0027s a sequence of flashing lights. Olivia wants Walter to return to the mental institution much to Peter\u0027s outcry, but Walter\u0027s determination to help ends up having chilling ramifications.","id":87935,"episode_number":8,"season_number":1,"still_path":"/oq18EdDifUNmZaSqQUoxHza7qtd.jpg","vote_average":0.0},{"name":"The Dreamscape","overview":"The team is called in to investigate why a man jumps out a window because he thinks he\u0027s being attacked by butterflies. Olivia gets some breaks in solving the case from her former partner and that she is so desperate to rid herself of him that she demands to go back into the tank. Meanwhile, some former friends and current foes of Peter find out that he\u0027s back in Boston.","id":87941,"episode_number":9,"season_number":1,"still_path":"/rsQSLxFOAGZoODUjQcEu49VapE3.jpg","vote_average":0.0},{"name":"Safe","overview":"The team is called in on a bank robbery similar to other robberies in the area but this particular bank has the thief embedded inside the steel wall of the bank. Somehow the thieves have found a way to defy the law of physics. Walter thinks they\u0027re after something of his. As the investigation deepens it all comes to a head when the thieves ambush one of the team.","id":88023,"episode_number":10,"season_number":1,"still_path":"/m4SJVVGib2WcDbufjqsrITVWoqL.jpg","vote_average":0.0},{"name":"Bound","overview":"\"Bound\" is the eleventh episode of the first season of the American science fiction drama television series Fringe. It follows the aftermath of Olivia\u0027s capture in the previous episode, and subsequent efforts to identify and apprehend her kidnappers. Along with a double agent, Olivia\u0027s investigation is hampered by the appearance of Sanford Harris, an old adversary hired to audit Fringe Division.\n\nThe episode was written by series co-creators J.J. Abrams, Alex Kurtzman, and Roberto Orci, as well as executive producer Jeff Pinkner. Frederick E. O. Toye served as the episode\u0027s director, and sought to create a \"creepy and weird\" atmosphere for Olivia\u0027s kidnapping scene to help emphasize her \"terrible circumstances.\" First director Gary Rake believed Olivia\u0027s action scenes took her to a \"higher level\", and Torv herself enjoyed filming them. In addition, the episode was the first to feature Ari Graynor as Olivia\u0027s sister, Rachel. Other guest actors included Chance Kelly, Michael Gaston, Lily Pilyblad, Sara Wilson, Stephen Schnetzer, and Peter Jay Fernandez.\n\nThe episode first aired on January 20, 2009 on the Fox network, and was watched by an estimated 11.96 million viewers. \"Bound\" received generally positive reviews from television critics, as many viewed it as an improvement over previous episodes. Actor Joshua Jackson noted the importance of \"Bound\" developmentally for the series. At the 61st Primetime Emmy Awards, the episode was submitted in the \"Outstanding Directing for a Drama Series\" and \"Outstanding Writing for a Drama Series\" categories. Both were unsuccessful in securing nominations.","id":88066,"episode_number":11,"season_number":1,"still_path":"/6KU9lCVQe9nwTb9T8aaj3RMCM6O.jpg","vote_average":0.0},{"name":"The No-Brainer","overview":"\"The No-Brainer\" is the 12th episode of the first season of the American science fiction drama television series Fringe. The episode was written by David H. Goodman and Brad Caleb Kane, and it was directed by John Polson.\n\nIt first aired in the United States on January 27, 2009 on the Fox Broadcasting Company. It also marks the first appearance of the \u0027ad-beginners\u0027 the glyphs that appear before each act break and at the end decoded they spell BISHOP","id":88087,"episode_number":12,"season_number":1,"still_path":"/1syvQsflMJOAhmoe0KNaf6FZvA9.jpg","vote_average":0.0},{"name":"The Transformation","overview":"\"The Transformation\" is the thirteenth episode of the first season of the American science fiction drama television series Fringe. Its storyline centers on the circumstances surrounding a deceased scientist, who was doped with a \"designer virus\" and transformed into a dangerous monster, causing his plane to crash. Fringe agent Olivia Dunham and FBI consultants Peter and Walter Bishop connect the event to an impending arms deal. Olivia must explore her mind for remaining memories of her former partner and lover, John Scott, in order to prevent the sale of the virus.\n\nThe episode was co-written by Zack Whedon and supervising producer J. R. Orci, while producer Brad Anderson served as the director. The creation of the monster took the crew approximately eleven days – they took molds of guest actor Huff\u0027s head and back and created eight sets of dentures in order to create the special effect of transformation. To create the plane crash set, the crew spent over a week strategically placing around 15,000 pounds worth of plane parts.\n\nIt was first screened at PaleyFest in November 2008. On February 3, 2009, the episode was broadcast in the United States on Fox to an estimated 12.78 million viewers. The episode earned a 5/6.5 ratings share among adults aged 18 to 49, finishing in eighth place for the week. It received generally positive reviews. Commentators have noted allusions to the pilot and a fourth season episode, in addition to the television series Lost and H.G. Wells\u0027 novel The Island of Doctor Moreau.","id":88061,"episode_number":13,"season_number":1,"still_path":"/4qMQ0K6py09rrNOTGgRdLPiXWAP.jpg","vote_average":0.0},{"name":"Ability","overview":"German agents question Olivia about her “relationship” with David Robert Jones, an escaped prisoner questioned months earlier now living in the U.S. The Fringe Division investigates a threatening case where victims die faceless from their orifices suddenly sealing.","id":87947,"episode_number":14,"season_number":1,"still_path":"/6m297Yk3XZxlrvftjmP4RC9eWTg.jpg","vote_average":0.0},{"name":"Inner Child","overview":"Just seconds before a building is demolished, a mysterious mute child that has been living alone underground is discovered. When the FBI’s Fringe Division investigates, the boy forms an unspoken connection with Agent Olivia Dunham. Meanwhile, an especially gruesome serial killer resurfaces and showcases his “artistry” by displaying his work publicly. As the boy gradually assimilates into a new environment, Olivia and the team must race against the clock to prevent the mad man from causing further massacre.","id":87976,"episode_number":15,"season_number":1,"still_path":"/sV8bZYAIibADCBN7qWiG5IUVXnp.jpg","vote_average":0.0},{"name":"Unleashed","overview":"As animal rights activists ransack a laboratory, they get more than they bargained for when one of the caged “animals” unleashes a ferocious appetite. Leaving grotesquely mutilated dead bodies in its wake, the scientifically engineered beast with the body of a lion, claws of an eagle, fangs of a viper, skin of a rhinoceros and tail of a serpent attacks Charlie. With Charlie’s life on the line, Walter must come face-to-face with both his past and the beast.","id":87996,"episode_number":16,"season_number":1,"still_path":"/i2GBaVe4aMqLiFBcs3uzZd4Y89z.jpg","vote_average":0.0},{"name":"Bad Dreams","overview":"Olivia dreams about a suicide as the event really happens at Grand Central Station; shocking information about the Z.F.T. manuscript is revealed.","id":88003,"episode_number":17,"season_number":1,"still_path":"/8LkFK3oQJryp6hAISiMF6LXNa71.jpg","vote_average":0.0},{"name":"Midnight","overview":"The Fringe Division is on the case when severely mutilated bodies drained of spinal cord fluid begin to pile up. After their investigation leads them to a scientist (guest star Jefferson Mays) with possible ties to the Z.F.T. bioterrorist cell, they are shocked to discover the identity and motive of the killer. When the kills occur with increasing frequency, Olivia, Peter and Walter go to desperate lengths to stop them.","id":88006,"episode_number":18,"season_number":1,"still_path":"/2Eko0DSHihsyeo2KRRyxGSYo6Zx.jpg","vote_average":0.0},{"name":"The Road Not Taken","overview":"Olivia experiences \"awake dreams,\" seeing elaborate visions of things not really there. While investigating a disturbing case of a woman who apparently spontaneously combusted, Olivia throws caution to the wind and explores her unexplained visions further. Meanwhile, Walter discusses key information about the Z.F.T. manifesto, and Peter reveals a secret that yields unexpected results in the case.","id":88052,"episode_number":19,"season_number":1,"still_path":"/kb96WeSpRuymMEJP0PB4UCP9NPC.jpg","vote_average":0.0},{"name":"There\u0027s More Than One of Everything","overview":"Setting the stage for the dramatic and revealing first season finale are a sudden and unexpected attack on someone with close ties to Fringe Division, the return of bioterrorist David Robert Jones and the inexplicable disappearance of Walter. Find out more about the mysterious events surrounding our trio when questions are answered, observations made, loyalties are tested and the elusive William Bell is finally introduced.","id":88013,"episode_number":20,"season_number":1,"still_path":"/tZtZk3Rd2NG7UUlXVKnuXanWvdm.jpg","vote_average":0.0}],"name":"Season 1","overview":"The first season of the American science fiction television series Fringe commenced airing on the Fox network on September 9, 2008, and concluded on May 12, 2009. It was produced by Bad Robot Productions in association with Warner Bros. Television, and its showrunners were Jeff Pinkner and J.H. Wyman. The first season introduces a Federal Bureau of Investigation \"Fringe Division\" team based in Boston, Massachusetts under the supervision of Homeland Security. The team uses unorthodox \"fringe\" science and FBI investigative techniques to investigate a series of unexplained, often ghastly occurrences, which are related to mysteries surrounding a parallel universe. FBI agent Olivia Dunham is portrayed by actress Anna Torv, while actors Joshua Jackson and John Noble play father-son duo Peter and Walter Bishop. Other regular cast members include Lance Reddick, Jasika Nicole, Blair Brown, Mark Valley, and Kirk Acevedo.\n\nThe season contained 21 episodes, although only 20 of them aired as part of the first season. The unaired episode, \"Unearthed\", was aired a few days before the episode \"Johari Window\" as a special episode during the show\u0027s second season.","id":4690,"poster_path":"/kMmeA68BBA6zcwaAcrcL3oICAY6.jpg","season_number":1}