{"episodes":[{"name":"Rose","overview":"Rose Tyler meets a mysterious stranger called the Doctor, and realises Earth is in danger.","id":941474,"episode_number":1,"season_number":1,"still_path":"/irTDkbtPQ4aM9YQw1uEevzk5rSz.jpg","vote_average":7.7},{"name":"The End of the World","overview":"The Doctor takes Rose on her first voyage through time: to the year five billion, when the Sun is about to expand and swallow the Earth. She is cautious and soon starts to question her reasons for joining The Doctor. But amongst the powerful alien races gathering to watch on Platform One, a murderer is at work. Who is controlling the mysterious and deadly metal spiders?","id":941475,"episode_number":2,"season_number":1,"still_path":"/hg7IMOwTe5zV89CjcoOv0tJFZe6.jpg","vote_average":7.5},{"name":"The Unquiet Dead","overview":"Charles Dickens and the Doctor team up as corpses stalk the streets of Victorian Cardiff.","id":968589,"episode_number":3,"season_number":1,"still_path":"/l3oSyFTBXYVSRMNXBEC2u40Jw60.jpg","vote_average":7.0},{"name":"Aliens of London (1)","overview":"Rose is taken home, but a spaceship crashes in the Thames and London is closed off... Enter the Slitheen!","id":968590,"episode_number":4,"season_number":1,"still_path":"/cCmY8qKoI88FMuZaQ8GzYMQxDWt.jpg","vote_average":7.5},{"name":"World War Three (2)","overview":"Time is running out for the Doctor as Downing Street announces mankind\u0027s first Interplanetary War.","id":968592,"episode_number":5,"season_number":1,"still_path":"/oMyzp40ovZV0OKOcMcLSoV0WMVV.jpg","vote_average":8.0},{"name":"Dalek","overview":"The Doctor is shattered and Earth is in danger as he and Rose discover the Time Lords\u0027 deadliest enemy beneath Utah.","id":968595,"episode_number":6,"season_number":1,"still_path":"/go14P6iykl0fnkXVD4RXRI08Bk1.jpg","vote_average":8.75},{"name":"The Long Game","overview":"Adam catches a glimpse of the wonders of travelling in the Tardis, as they head to a future, where Satellite 5 broadcasts to the entire Earth Empire. But anyone promoted to Floor 500 is never seen again, and the Doctor suspects mankind is being manipulated.","id":968596,"episode_number":7,"season_number":1,"still_path":"/fiGTKcv29xHiy5sjyW11k5RzNEN.jpg","vote_average":7.5},{"name":"Father\u0027s Day","overview":"Rose requests a trip back to the day her father, Pete Tyler, died. Reluctantly, the Doctor agrees, but he realises he has made a mistake, when Rose saves Pete from being run over by a car. This has now changed the timeline, and Reapers are transposing themselves all over the Universe. However, this time, the Doctor doesn\u0027t have a plan…","id":968597,"episode_number":8,"season_number":1,"still_path":"/5PQa7xD2iL7BkBlF8JNZyCgWefI.jpg","vote_average":8.75},{"name":"The Empty Child (1)","overview":"After chasing an unexplained capsule through time, the TARDIS lands in London, during an air raid. Rose investigates when a small child wearing a gasmask, standing on a rooftop, continuously calls out for his mummy. After floating above the city on a barrage balloon, Rose is swept off her feet by another time traveller – Captain Jack Harkness. Meanwhile, The Doctor follows a teenaged girl to a meeting of the homeless children of the Blitz. Here, the child in the gasmask is terrorising them with a parade of strange events, constantly asking for his mother.","id":968598,"episode_number":9,"season_number":1,"still_path":"/4JwPlEI4qWbnQVX1TlZNlUAyHcB.jpg","vote_average":9.0},{"name":"The Doctor Dances (2)","overview":"After narrowly escaping the gas mask monsters, The Doctor, Rose, and Captain Jack try to stop the mutated people from infecting other victims. But it soon becomes apparent that one of the group may indirectly responsible for the virus. The answer lies at the bomb site, but time is running out...","id":968599,"episode_number":10,"season_number":1,"still_path":"/yE8fusMqHwGHdCDi9lNMBuSYXUT.jpg","vote_average":8.75},{"name":"Boom Town","overview":"The Doctor, Rose and Captain Jack stop off in present-day Cardiff to recharge the TARDIS on the Rift they formerly encountered in 1869. Whilst there, they come upon a since-thought-long-dead enemy of theirs, who is hatching yet another plan to destroy Earth.","id":968600,"episode_number":11,"season_number":1,"still_path":"/t9ossMxqe5WVBvGkaWA8ReO4Xnu.jpg","vote_average":8.75},{"name":"Bad Wolf","overview":"In a seemingly futuristic world, the Doctor wakes up in the Big Brother house during an eviction, Rose wakes up on the Weakest Link with the Anne-Droid, and Captain Jack gets a make over with Trin-E and Zu-Zana. But something unusual is happening, and the losing contestants are being disintergrated. Obviously, it\u0027s time for the Doctor to investigate. There could be only one monster behind this - the Daleks!","id":968601,"episode_number":12,"season_number":1,"still_path":"/wvKyXn0WGmR32KCsRaRPbKKzCW1.jpg","vote_average":8.5},{"name":"The Parting of the Ways","overview":"The fate of the Universe is hanging in the balance as the Dalek fleet begin their invasion of Earth. The Doctor must decide whether to sacrifice every human being on Earth in order to save every other living creature in the universe from the Daleks. Either way, he knows he must send Rose home...","id":968602,"episode_number":13,"season_number":1,"still_path":"/umvpeUdQ4WrkRq5YXWtwU7k0zDx.jpg","vote_average":9.75}],"name":"Series 1","overview":"The new first series of British science fiction series Doctor Who began on 26 March 2005 with the episode \"Rose\", which marked the end of the programme\u0027s 16-year absence from episodic television following its cancellation in 1989, and the first new televised Doctor Who story since the broadcast of the TV movie starring Paul McGann in 1996. The finale episode, \"The Parting of the Ways\", was broadcast on 18 June 2005. The show was revived by long time Doctor Who fan Russell T Davies, who had been lobbying the BBC since the late-90s to bring the show back. The first series comprised 13 episodes, eight of which Davies wrote. Davies, Julie Gardner and Mal Young served as executive producers, Phil Collinson as producer.\n\nThe show depicts the adventures of a mysterious and eccentric Time Lord known as the Doctor, who travels through time and space in his time machine, the TARDIS, which normally appears from the exterior to be a blue 1950s British police box. With his companions, he explores time and space, faces a variety of foes and saves civilizations, helping people and righting wrongs. The first series features Christopher Eccleston as the ninth incarnation of the Doctor, his only series as the Doctor, accompanied by Billie Piper, as his first and main companion Rose Tyler, whom he plucks from obscurity on planet Earth, and to whom he grows increasingly attached. He also travels briefly with unruly boy-genius Adam Mitchell, played by Bruno Langley, and with 51st-century con man and former \u0027Time Agent\u0027 Captain Jack Harkness, portrayed by John Barrowman. Episodes in series one form a loose story arc, based upon the recurring phrase \"Bad Wolf\", the significance of which goes unexplained until the two-part series finale.","id":58468,"poster_path":"/9Jt2FFCAME7eHDC28r4qCHErhhF.jpg","season_number":1}