{"episodes":[{"name":"Non Est Asylum","overview":"Constantine has checked himself into Ravenscar Asylum following the loss of a 9-year-old girl, Astra to the demon Nergal. The loss of her soul, along with his own, has been tormenting him. Naturally, he\u0027ll have to snap out of it. That moment comes six months later when a possessing spirit sends him a disturbing message. John is on a mission to save the daughter of a friend who is being targeted by a demonic antagonist.","id":977342,"episode_number":1,"season_number":1,"still_path":"/e0Od0VL3gsQRyG6SyZGJbAuKfWO.jpg","vote_average":7.3333335},{"name":"The Darkness Beneath","overview":"Deep in the mountains of Western Pennsylvania, John is a small mining community\u0027s only defense against an ancient Welsh spirit. In the course of protecting these isolated innocents, John finds a vital new ally in a mysterious young woman named Zed.","id":1012005,"episode_number":2,"season_number":1,"still_path":"/eWJUQ86oKSvKi7SQlsddVfuIcLR.jpg","vote_average":7.8333335},{"name":"The Devil\u0027s Vinyl","overview":"John and Zed engage in a dangerous confrontation to save a woman and her family from sinister forces. John\u0027s efforts force him to confront the darkness in his own life - while also coming face to face with a new powerful adversary in Papa Midnite.","id":1012006,"episode_number":3,"season_number":1,"still_path":"/zE7FGU6j4MvrARNqTpvJARu2KL1.jpg","vote_average":5.75},{"name":"A Feast of Friends","overview":"When Constantine\u0027s old friend Gary Lester accidentally releases a powerful demon in Atlanta, John is forced to determine exactly what he is prepared to sacrifice in his battle with the underworld.","id":1014115,"episode_number":4,"season_number":1,"still_path":"/k8jfg4xneF0kbdJD6HY4xXpJ4wE.jpg","vote_average":7.1666665},{"name":"Danse Vaudou","overview":"In New Orleans, Constantine\u0027s unusual knowledge of a string of crimes gets him into trouble with Detective Jim Corrigan. He must form an unholy alliance with Papa Midnite when a voodoo ritual to help people communicate with their dead loved ones takes a deadly turn.","id":1014116,"episode_number":5,"season_number":1,"still_path":"/znz299edHGpqZZiMBJKIp07dlmJ.jpg","vote_average":8.0},{"name":"Rage of Caliban","overview":"When a young boy is taken over by a malevolent spirit, John must put aside his misgivings over exorcising a child and convince the parents that their boy is not all that he seems.","id":1014117,"episode_number":6,"season_number":1,"still_path":"/s5xcToalypAKX7LxJQWopzA8xck.jpg","vote_average":8.5},{"name":"Blessed Are the Damned","overview":"While in art class, Zed has a bizarre vision of snakes that lead her and John to a small town where a preacher has mysteriously gained the ability to heal his congregation.","id":1014118,"episode_number":7,"season_number":1,"still_path":"/vHTOuq1L8idPYFr08hJp3ul2zfk.jpg","vote_average":6.75},{"name":"The Saint of Last Resorts","overview":"A call from Anne Marie, a member of the fateful Newcastle crew, sends John and Chas to Mexico City and brings them closer to the source of The Rising Darkness. Meanwhile, Zed\u0027s past comes back to haunt her.","id":1014119,"episode_number":8,"season_number":1,"still_path":"/gcdQYESDGaIsidCCb5Z0wzf1dd9.jpg","vote_average":8.5},{"name":"The Saint of Last Resorts: Part Two","overview":"In order to fend off a vicious attack, John summons a demon into himself. Chas, Zed and Anne Marie race against time to save John before it’s too late.","id":1014120,"episode_number":9,"season_number":1,"still_path":"/5NgLl3ddDYvxOjtPM3IxhG6Zu24.jpg","vote_average":8.5},{"name":"Quid Pro Quo","overview":"Thousands of people across Brooklyn have slipped into a mysterious coma, including Chas\u0027 daughter. John must find and defeat the evil behind it before it consumes the city.","id":1034103,"episode_number":10,"season_number":1,"still_path":"/h1KI0ND5XkNYL4YWEXe69gLH9ea.jpg","vote_average":7.75},{"name":"A Whole World Out There","overview":"Manny sends John to help an old friend, Ritchie Simpson, at Ivy University where a group of students have a found a way into an alternate dimension only to be met by a maniacal killer.","id":1034104,"episode_number":11,"season_number":1,"still_path":"/bOaiqIdb0clRcwgEKKJikjp0sgy.jpg","vote_average":8.5},{"name":"Angels and Ministers of Grace","overview":"When John heads to a local hospital to investigate a mysterious attack, he enlists an unwitting Manny to help him. Meanwhile, a health scare causes Zed to question the source of her visions.","id":1034106,"episode_number":12,"season_number":1,"still_path":"/id9BHaK9RKqDB7rv2KDi7NnoVow.jpg","vote_average":8.0},{"name":"Waiting for the Man","overview":"John and Zed return to New Orleans when Detective Jim Corrigan asks for their help in the case of a missing girl. Papa Midnite takes steps toward exacting his revenge on John. Meanwhile, the truth behind the Rising Darkness comes to light.","id":1034105,"episode_number":13,"season_number":1,"still_path":"/axrybNWSsbxtZ6fMBqMqKgCU9jC.jpg","vote_average":6.75}],"name":"Season 1","overview":"","id":60549,"poster_path":"/A5omafoLtfc6oCnmFSEFaOSwNx.jpg","season_number":1}