{"episodes":[{"name":"Dexter","overview":"Dexter Morgan, a Miami Metro Police Department blood spatter analyst, is living a double life.  After his day job with the police department, Dexter moonlights as a serial killer, hunting and killing criminals who slip through the justice system.  Dexter\u0027s sister, Debra, a vice squad officer, pulls Dexter into her world when another serial killer is killing prostitutes and leaving their bloodless bodies dismembered in various locations around Miami.  Meanwhile, Dexter hunts a man who made snuff videos and killed a mother of two.","id":953083,"episode_number":1,"season_number":1,"still_path":"/JuCgM3T2FWgZxqdSGJr9nY6Tul.jpg","vote_average":9.25},{"name":"Crocodile","overview":"As Dexter stalks his next victim, a drunk driver who is about to be acquitted for vehicular homicide that resulted in the death of a teenage boy, the Ice Truck Killer strikes again and later gets in touch with Dexter.  Meanwhile, when a cop is found murdered, Dexter helps Doakes and Debra investigate a crime boss who they believe is responsible.","id":953084,"episode_number":2,"season_number":1,"still_path":"/29NoKmFb1OTyvq3Mm8ykNq07QA3.jpg","vote_average":9.25},{"name":"Popping Cherry","overview":"\"The Ice Truck Killer\" strikes again and new homicide officer Debra is assigned the case, but she gets reprimanded for violating the chain of command; flashbacks offer insight into Dexter\u0027s homicidal tendencies and take him back to his first time \"taking out the garbage\"; Doakes gets on the bad side of a drug kingpin.","id":953085,"episode_number":3,"season_number":1,"still_path":"/uSeoPF4Jzw2cRHoK2kcEBjjEiDp.jpg","vote_average":9.25},{"name":"Let\u0027s Give the Boy a Hand","overview":"The Ice Truck Killer leaves severed body parts from his victims at locations that are linked to memories from Dexter\u0027s troubled childhood, which begins to get into Dexter\u0027s head.","id":953086,"episode_number":4,"season_number":1,"still_path":"/fdKEeBZJ3ZUozLCOwwMmcvRA71E.jpg","vote_average":9.25},{"name":"Love American Style","overview":"The homicide division is handed an unbelievable lead when the Ice Truck Killer\u0027s latest victim is found alive but mutilated; Dexter is on the trail of a person who traffics in humans.","id":953087,"episode_number":5,"season_number":1,"still_path":"/fpLBlBrhOSqUHXDEiiTRh9k7zPj.jpg","vote_average":9.25},{"name":"Return to Sender","overview":"The Ice Truck Killer leaves a clue at the scene where Dexter has dispatched his latest victim, and Dexter is worried that someone might have witnessed his killing. Rita is trying to deal with her ex-husband.","id":953088,"episode_number":6,"season_number":1,"still_path":"/w1AEifTW6VVAZfO2nuTtU3pampT.jpg","vote_average":9.5},{"name":"Circle of Friends","overview":"The squad identifies the Ice Truck Killer; Rita\u0027s ex-husband, an abusive addict, is paroled.","id":953089,"episode_number":7,"season_number":1,"still_path":"/gpqFeUvCSMNWFd4IJbtY2FH6noD.jpg","vote_average":10.0},{"name":"Shrink Wrap","overview":"Dexter appears to be connected to a psychiatrist suspected of murdering a suicidal patient.","id":953090,"episode_number":8,"season_number":1,"still_path":"/dVgkD1GnbZWrDballxqiGE3Yh3H.jpg","vote_average":10.0},{"name":"Father Knows Best","overview":"While on a weekend getaway with Rita, his sister and her new beau, Dexter learns that his biological father, thought to be dead for 30 years, has just passed away, and that he\u0027s willed his son everything he owned.","id":953091,"episode_number":9,"season_number":1,"still_path":"/yIJdjhDdBuxNwYo2nEBVtWSX25t.jpg","vote_average":10.0},{"name":"Seeing Red","overview":"The Ice Truck Killer prepares a crime scene for Dexter: a hotel room all covered in his previous victim\u0027s blood. But Dexter does not appreciate this gift, because his childhood memories hunt him.","id":953092,"episode_number":10,"season_number":1,"still_path":"/fjx5CEGlPrx2VmRCnn1zlTTbeRL.jpg","vote_average":10.0},{"name":"Truth Be Told","overview":"The Ice Truck Killer sets a trap for Dexter by kidnapping someone close to him; Dexter\u0027s increasingly odd behavior piques Doakes\u0027s interest.","id":953093,"episode_number":11,"season_number":1,"still_path":"/igwp2lTwkn8LoLTLBzPG49hzqbB.jpg","vote_average":9.25},{"name":"Born Free","overview":"Dexter figures out who the Ice Truck Killer is, along with a dark secret from his troubled past. Meanwhile, La Guerta is replaced with a new boss and Angel figures out a way how to track the killer while he\u0027s still in hospital.","id":953094,"episode_number":12,"season_number":1,"still_path":"/1ObZDLK3f7BucdgtmAlHZRYN3IB.jpg","vote_average":9.25}],"name":"Season 1","overview":"The first season of Dexter is an adaptation of Jeff Lindsay\u0027s first novel in the Dexter series, Darkly Dreaming Dexter. Subsequent seasons have featured original storylines. This season aired from October 1, 2006 to December 17, 2006, and follows Dexter\u0027s investigation of \"The Ice Truck Killer\". Introduced in the first episode, \"Dexter\", this serial killer targets prostitutes and leaves their bodies severed and bloodless. At the same time, Dexter\u0027s foster sister, Debra Morgan, a vice squad officer, aspires to work in the homicide department, and Dexter\u0027s girlfriend, Rita Bennett, wants their relationship to be more intimate. Christian Camargo appears as Rudy Cooper and is a recurring character until the end of the season.\n\nThe show\u0027s first season received generally favorable reviews from critics; it was praised as \"bold, different and exciting, with a central character and performance that take your breath away\" by the New York Daily News. The Wall Street Journal saw \"the grotesqueries of Dexter\" as \"not something that can easily be dismissed with the old \"you don\u0027t have to watch\" line\", and concluded that \"We do have to live among the viewers who will be desensitized, or aroused, by this show\". The aggregate site Metacritic scored the show\u0027s first season at 77 out of 100 based on 27 critics reviews.","id":59499,"poster_path":"/bNC5EEc6aPAMhKLvf38JiVwL7o0.jpg","season_number":1}