{"episodes":[{"name":"Pilot","overview":"A documentary crew arrives at the offices of Dunder Mifflin to observe the employees and learn about modern management. Manager Michael Scott tries to paint a happy picture, while sales rep Jim fights with his nemesis Dwight and flirts with receptionist Pam.","id":170135,"episode_number":1,"season_number":1,"still_path":"/qSIPTlgutivKQOAXO5DlgUPtOIn.jpg","vote_average":0.0},{"name":"Diversity Day","overview":"A consultant arrives to teach the staff about tolerance and diversity but Michael insists on imparting his own knowledge. Meanwhile, Jim struggles to keep hold of a lucrative contract extension.","id":170132,"episode_number":2,"season_number":1,"still_path":"/h539DweEaSNFQQPwwpbjKIuM1L.jpg","vote_average":0.0},{"name":"Health Care","overview":"Michael doesn\u0027t want to upset the staff so he gets Dwight to pass on news about the company\u0027s reduced health provisions. Fed up with his nosiness, Jim and Pam pretend they are suffering from a variety of conditions including Ebola, Mad Cow Disease, spontaneous dentohydroplosion, hotdog fingers, nano-robot infection, inverted penis and anal fissures.","id":170134,"episode_number":3,"season_number":1,"still_path":"/oQd8zzPk64Sn2dsFMHFN8uCdRfc.jpg","vote_average":0.0},{"name":"The Alliance","overview":"Michael arranges a morale-boosting birthday party for Meredith and is determined to come up with the funniest message in her card. Dwight wants a pact with Jim to fight the downsizing, and Michael regrets showing off when Oscar asks for sponsorship for a charity walk being undertaken by his nephew, who has cerebral palsy.","id":170133,"episode_number":4,"season_number":1,"still_path":"/upKB46d5klri3jmOkZqjuRpqAOo.jpg","vote_average":0.0},{"name":"Basketball","overview":"The office staff play a basketball game against the warehouse workers in which Jim shows off to impress Pam and upstage her fiancee who is on the opposing team.","id":170131,"episode_number":5,"season_number":1,"still_path":"/1cvMeuQYpgvLQYre6FTkVHmlV3G.jpg","vote_average":0.0},{"name":"Hot Girl","overview":"A woman who comes to the office to sell purses gets the male members of staff excited. She rejects Dwight\u0027s advances, but Michael reckons he\u0027s still in with a chance.","id":170130,"episode_number":6,"season_number":1,"still_path":"/aeKIJvE2EhW1kl1k0bpqrrzft54.jpg","vote_average":0.0}],"name":"Season 1","overview":"The first season of the American television comedy The Office premiered in the United States on NBC on March 24, 2005, concluded on April 26, 2005, and consists of six episodes. The Office is an American adaptation of the British TV series of the same name, and is presented in a mockumentary format, portraying the daily lives of office employees in the Scranton, Pennsylvania branch of the fictitious Dunder Mifflin Paper Company.\n\nThis season introduced the main characters, and established the general plot, which revolves around Michael Scott, regional manager of the Scranton branch office, trying to convince the filmmakers of the documentary that he presides over a happy, well-running office. Meanwhile, sales rep Jim Halpert finds methods to undermine his cube-mate, Dwight Schrute; receptionist Pam Beesly tries to deal with Michael\u0027s insensitivities and flubs; and temporary employee Ryan Howard is acting mostly as an observer of the insanity around him.\n\nSeason one of The Office aired on Tuesdays in the United States at 9:30 p.m. The season debuted to high numbers, and garnered moderately positive reviews from critics aside from a poorly-received pilot episode. While some enjoyed the pilot, others opined that it was a mere copy of the original British version. Universal Studios Home Entertainment released season one in a single DVD on August 16, 2005. The DVD contained all six episodes, as well as commentaries from creators, writers, actors, and directors on most of the episodes, as well as deleted scenes from all of the episodes.","id":7240,"poster_path":"/9vZrysV90QmRz0HXQ1hP0g935hU.jpg","season_number":1}